{"meta":{"title":"imesong","subtitle":"我们的征途是星辰大海","description":"","author":"imesong","url":"http://imesong.com","root":"/"},"pages":[{"title":"imesong","date":"2019-11-29T20:22:25.000Z","updated":"2019-11-29T20:22:25.000Z","comments":true,"path":"about/index.html","permalink":"http://imesong.com/about/index.html","excerpt":"","text":"基本信息 2013年毕业于河南理工大学，通信工程专业 专注大前端领域，移动端 App研发，技术管理 盖洛普优势：和谐、学习、审慎、交往、专注（2021 年 1 月） 专业技能 专注 App 软件研发，9年Android 开发经验，4 年 10 人以上团队管理经验。 熟悉大型 Android 项目的软件架构，负责过多款百万级 DAU 项目的架构设计，对 APP 架构治理、组件化、插件化等有深入研究。 熟悉常用的 App 性能优化方案和工具，对启动速度、内存、流畅度等有丰富的实践经验。 熟悉 Java&#x2F;Kotlin&#x2F;JS 语言，了解TS &#x2F;React，有跨平台的经验。 自我驱动、执行力强，有较好的目标管理和落地能力。 工作经历2021年5月 —— 至今 字节跳动 - Tiktok - 国际化电商 2014年3月——2021年5月 上海二三四五网络科技有限公司 创新孵化中心技术负责人 负责创新孵化中心研发团队管理，孵化业务的项目管理，移动专业线技术负责人之一； 先后负责可映、内容中心、玩赚星球、天气王、手机浏览器、移动数据统计等多种业务产品的开发； 负责公司移动端人员招聘、移动方向技术评审，公司内部培训讲师； 负责公司移动方向的规划和公共技术的调研，基础架构和性能优化； 2013年7月——2014年3月 上海京天物联网科技有限公司 开发工程师 客户端核心开发人员，负责基础框架搭建，数据采集、定位等核心功能的开发,独立完成两款移动 App 的交付；"},{"title":"archives","date":"2019-11-29T20:22:53.000Z","updated":"2019-11-29T20:22:53.000Z","comments":true,"path":"archives/index.html","permalink":"http://imesong.com/archives/index.html","excerpt":"","text":""},{"title":"categories","date":"2019-11-29T14:15:36.000Z","updated":"2019-11-29T14:15:36.000Z","comments":true,"path":"categories/index.html","permalink":"http://imesong.com/categories/index.html","excerpt":"","text":""},{"title":"sitemap","date":"2019-11-29T20:22:06.000Z","updated":"2019-11-29T20:22:06.000Z","comments":true,"path":"sitemap/index.html","permalink":"http://imesong.com/sitemap/index.html","excerpt":"","text":""},{"title":"","date":"2019-11-29T14:14:57.000Z","updated":"2019-11-29T14:14:57.000Z","comments":true,"path":"tags/index.html","permalink":"http://imesong.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"M5-OKR-Review","slug":"M5-OKR-Review","date":"2023-05-27T00:00:00.000Z","updated":"2023-05-27T00:00:00.000Z","comments":true,"path":"2023/05/27/M5-OKR-Review/","link":"","permalink":"http://imesong.com/2023/05/27/M5-OKR-Review/","excerpt":"[[Q2-2023-OKR]] Conclusion 0.3","text":"[[Q2-2023-OKR]] Conclusion 0.3 O1 提升客户端架构设计能力，完成通用侧技术架构升级 0 在客户端架构上，没有实际的进步和产出 O2 综合能力提升 0.5 面试材料准备按计划完成 MEM 数学和逻辑的学习进度不及预期 学习一些不错的专栏 技术人生系列 韩老板系列 左耳朵分享的文章 Notion dashboard 使用方式常规化，逐渐养成习惯 GTD 使用更加熟练 滴答清单 Notion Inbox&#x2F;Task Lark -TODO TimingBoxing 时间都去哪了？ DirtyWork O3 英语能力 0.3 恋恋有词 简单词汇未按计划完成掌握，只学习一遍 基础语法部分完成一遍学习，未总结归纳，现在基本已忘光了。 原味英语按时打卡，业务英语和听力有提升 O4 提升写作能力 0.3 pkm 新增 五彩插件做信息输入 滴答清单助手公众号不可用，新的 App 端信息收集方式暂未找到，通过notion 中转。 开通VIP解决！ O5 幸福感 0.5 血压日常记录，生活方式调整，未见明显变化。 Waiting for Nora","categories":[],"tags":[],"author":"imesong"},{"title":"长期主义","slug":"长期主义","date":"2023-05-13T00:00:00.000Z","updated":"2023-05-13T00:00:00.000Z","comments":true,"path":"2023/05/13/长期主义/","link":"","permalink":"http://imesong.com/2023/05/13/%E9%95%BF%E6%9C%9F%E4%B8%BB%E4%B9%89/","excerpt":"关于[[长期主义]]，ChatGPT这样说 以下内容来自open AI chatGPT的回答，只做排版和格式调整，内容仅供参考","text":"关于[[长期主义]]，ChatGPT这样说 以下内容来自open AI chatGPT的回答，只做排版和格式调整，内容仅供参考 Q：长期主义是什么意思？ChatGPT长期主义（Long-termism）是一种伦理观点和决策方法，强调考虑和优先关注长期未来的利益和福祉，而不仅仅关注当前和短期的利益。它认为我们应该采取行动以确保未来的世代能够享有可持续的资源、环境和生活条件。 长期主义的核心思想是，我们应该将我们的决策和行为的影响延伸到未来，并考虑未来世代的需求和权益。这意味着我们需要对气候变化、环境保护、资源管理、技术发展等问题进行长期规划和投资，以确保未来的可持续性和人类福祉。 长期主义与短期主义相对，短期主义更注重眼前的利益和满足当前的需求，而忽视了未来的影响和长期可持续性。长期主义强调长远利益的重要性，认为我们应该更加关注和考虑未来世代的需求和权益，从而采取更加可持续和负责任的行动。 长期主义在许多领域具有应用价值，包括环境保护、气候变化、经济发展、公共政策等。它提醒我们，我们的决策和行为应该超越眼前的短期利益，而要考虑到未来的可持续性和人类福祉。 Q：如何成为一个长期主义者？ChatGPT成为一个长期主义者可以通过以下方式： 提高长期思维意识：培养关注未来和长期影响的意识，将视野放在更广阔的时间尺度上。思考自己的决策和行动对未来世代的影响，并认识到长远利益的重要性。 学习和了解相关知识：深入了解环境保护、可持续发展、气候变化、公共政策等与长期主义相关的领域。阅读相关的书籍、报告和研究，了解不同领域的长期影响和可持续性挑战。 责任与行动：认识到个人的责任和作用，积极采取行动来促进长期利益和可持续发展。可以通过支持环保组织、参与公共倡议、投资可持续项目等方式来贡献自己的力量。 长期规划和决策：在自己的生活和工作中，采取长期规划和决策的方式。考虑到未来的影响和长期可持续性，避免短期利益的过度追求。例如，在投资中考虑环境、社会和治理（ESG）因素，选择可持续发展的产品和服务等。 教育他人和传播价值观：与他人分享你对长期主义的理解和认识，提高他们的长期思维意识。通过教育和传播长期主义的价值观，可以影响更多人采取长远利益和可持续发展的行动。成为一个长期主义者是一个渐进的过程，需要不断的学习、思考和行动。关键是培养长期思维意识，认识到自己的影响力和责任，并在日常生活中积极采取行动来促进长远利益和可持续发展。 Q：作为一个个体，如何成为一名长期主义者？ChatGPT：作为个体，你可以采取以下措施来成为一名长期主义者： 审视自己的价值观和目标：思考并明确你对未来的价值观和目标。考虑自己对环境、社会和未来世代的关注程度，并确立长期利益和可持续发展的重要性。 提高长期思维意识：培养关注未来和长期影响的意识。在日常生活中，思考自己的决策和行动对未来的影响，考虑长期利益和可持续性。 学习和了解相关知识：深入了解与长期主义相关的领域，例如环境保护、可持续发展、气候变化等。阅读相关书籍、报告和研究，加强对长期主义理念和可持续发展的理解。 责任与行动：认识到个人的责任和作用，积极采取行动来促进长期利益和可持续发展。例如，减少资源消耗，节约能源，支持环保组织，参与公益活动等。 长期规划和决策：在个人生活和职业发展中，采取长期规划和决策的方式。考虑到未来的影响和长期可持续性，避免追求短期利益的行为。例如，在职业发展中选择与可持续发展相关的领域，或者将长期利益纳入投资决策。 教育他人和影响他人：与他人分享你对长期主义的理解和认识，提高他们的长期思维意识。通过教育和传播长期主义的价值观，影响他人采取长远利益和可持续发展的行动。 通过这些措施，你可以逐步转变为一名长期主义者，将长期利益和可持续发展纳入自己的生活和决策中。关键是持续地反思和行动，不断提高自己的意识和实践。 Q：站在长期主义的角度，阐述一下如何做个人的规划ChatGPT站在长期主义的角度，个人规划应该考虑以下几个方面： 定义长期目标：首先，明确自己的长期目标。这些目标应该与可持续发展和长期利益相一致，例如提升自己的技能和知识、追求有意义的事业、促进环境保护等。确立清晰的长期目标可以帮助你有方向地规划和迈向未来。 识别短期和中期目标：将长期目标分解为短期和中期目标。短期目标是指能够在近期内实现的目标，中期目标是在长期目标实现之前需要达到的里程碑。分解目标有助于将远大的长期目标转化为具体可行的行动步骤。 综合考虑个人发展和社会影响：个人规划不仅关注自身的成长和利益，还应综合考虑社会和环境的影响。思考你的行动对社会、环境以及未来世代的影响，如何能够在个人成长的同时对他人和环境产生积极影响。 持续学习和发展：长期主义强调持续学习和发展的重要性。规划个人的学习路径，不断提升自己的技能和知识，以适应未来的变化和挑战。寻求学习机会、参与培训课程、阅读有关领域的书籍和文章等，不断扩展自己的视野和能力。 考虑风险和适应性：长期规划需要考虑到不确定性和风险。预留一定的灵活性和适应性，使自己能够应对未来可能出现的变化和挑战。在规划中考虑多种可能性，并采取相应的风险管理措施。 定期回顾和调整：个人规划不是一成不变的，需要定期回顾和调整。定期检查自己的目标和进展，看是否需要调整行动计划或目标设定。灵活性和适应性是长期主义的核心价值之一，因此，不断进行回顾和调整是必要的。 在制定个人规划时，长期主义的关键是将个人的成长和发展与社会、环境的长远利益相结合，追求可持续性的发展和共同的福祉。这样 Q：请继续ChatGPT这样的个人规划能够帮助你在个人成长的同时对社会产生积极影响，并为未来世代创造更好的环境和机会。以下是一些实际操作的建议： 制定明确的目标和里程碑：将长期目标分解为可量化和可操作的短期和中期目标。确保目标具体、可衡量，并设定合理的时间框架和里程碑。这样可以更好地跟踪和评估自己的进展。 学习和发展计划：根据个人规划的方向，制定学习和发展计划。确定需要学习的技能、知识和经验，并制定相应的学习计划。参加相关培训、课程或工作坊，积极寻求提升自身的机会。 建立支持网络：与志同道合的人建立联系，共同探讨和分享长期主义的理念和实践。参与社区、组织或在线论坛，与其他长期主义者进行交流和合作，互相支持和鼓励。 持续评估和调整：定期回顾个人规划，评估自己的进展和达成目标的效果。识别潜在的障碍和挑战，并采取适当的调整和改进措施。灵活性和适应性是长期主义者的重要品质，要有勇于调整的心态。 社会参与和影响力：积极参与社会活动和倡议，通过行动和言论影响他人和社会。参与环保项目、社区服务、公益活动等，推动可持续发展和长期利益的实现。 持续学习和关注领域发展：保持对相关领域的学习和关注，了解最新的研究、创新和趋势。持续学习和保持更新的知识可以帮助你更好地适应变化，并为个人规划做出优化和调整。 通过这些步骤，你可以将长期主义的价值观融入到个人的规划和行动中，实现个人成长与社会影响力的有机结合。同时，记得在规划的过程中保持积极的心态，持之以恒地追求自己的目标和愿景。 在日常的生活中，如何践行长期主义呢？以下是几个践行长期主义的建议，可以在日常生活中尝试： 设定长期目标：长期主义强调长远的眼光和目标，因此，设定长期的目标是非常重要的。这些目标应该是具有挑战性、可衡量和可实现的，可以分解为一系列短期的任务和计划。将目标写下来，并将其放在一个容易看到的地方，以便时常提醒自己。 坚持学习：长期主义者注重不断的学习和自我提高。无论是通过阅读书籍、参加课程、参加工作坊还是与他人交流，都可以让自己获得新的知识和技能。要把学习看作是一种长期的投资，因为不断的学习可以让你更好地适应不断变化的环境。 保持健康的生活方式：健康的生活方式可以帮助你长期保持健康和精力充沛。充足的睡眠、健康的饮食和适度的运动可以提高身体素质，减少生病的风险，提高工作效率和生产力。 建立积极的人际关系：建立积极的人际关系可以帮助你在长期的生活中获得支持和鼓励。与家人、朋友、同事和其他社交圈子建立良好的关系可以帮助你建立信任、获得帮助和建立更有意义的人际关系。 确立时间管理和优先事项：长期主义者应该优先处理那些对实现长期目标最重要的任务。建立一个时间表或日历，列出每天、每周和每月的任务和优先事项，确保你在有限的时间内集中精力处理最重要的任务。这也可以帮助你保持工作和生活的平衡，从而避免过度的压力和疲劳。 持续改进：长期主义者应该持续改进自己的工作和生活。这意味着不断地寻找改进的机会和方式，并不断地尝试新的方法和策略，以提高自己的表现和效率。这也可以帮助你发现新的机会和挑战，从而实现更高的目标和梦想。 总之，践行长期主义需要持久的毅力和决心，需要不断地寻找和实现长期的","categories":[],"tags":[],"author":"imesong"},{"title":"2024 交大 MEM 备考","slug":"MEM 2024 交大 MEM 备考","date":"2023-05-01T00:00:00.000Z","updated":"2023-05-01T00:00:00.000Z","comments":true,"path":"2023/05/01/MEM 2024 交大 MEM 备考/","link":"","permalink":"http://imesong.com/2023/05/01/MEM%202024%20%E4%BA%A4%E5%A4%A7%20MEM%20%E5%A4%87%E8%80%83/","excerpt":"MEM ：Master of Engineering Management，工程管理硕士，专业硕士学位。 记录 2024 年交大 MEM 到备考过程，包括前期的调研、提前批面试 、笔试学习资料准备、学习计划制定等，所有和 MEM 相关的事情都会汇总到这里。 MEM 择校，交大 or 复旦 2024 MEM 的关键时间线 提前批面试 笔试学习资料 笔试备考计划 如果需要详细的思维导图，可以添加个人微信 imesong2012 ，备注 交大MEM备考，一起学习交流，共同上岸。","text":"MEM ：Master of Engineering Management，工程管理硕士，专业硕士学位。 记录 2024 年交大 MEM 到备考过程，包括前期的调研、提前批面试 、笔试学习资料准备、学习计划制定等，所有和 MEM 相关的事情都会汇总到这里。 MEM 择校，交大 or 复旦 2024 MEM 的关键时间线 提前批面试 笔试学习资料 笔试备考计划 如果需要详细的思维导图，可以添加个人微信 imesong2012 ，备注 交大MEM备考，一起学习交流，共同上岸。 目标学校选择学校选择，前期锁定交大和复旦，没有再调研其他学校的硕士研究生信息，开始有点纠结 MBA 还是 MEM，学校选择交大和复旦个人感觉差异不是很大。参加了几场交大、复旦的MBA、EMBA、MEM 的招生说明会，同时和几个在交大读EMAB、MBA、MEM 的朋友了解后，决定报考交大的 MEM 。交大和复旦 MEM 的一些基本信息对比如下，仅供参考，复旦的部分数据来自2022年的历史统计，没有查找到2023年的最新政策说明。 基本信息 交大 复旦 学费 23.8万 19.8万 学制 2.5年 2年 招生规模 400人 80人 招生方向 项目管理方向 项目管理方向 学院 电子信息与电气工程学院 信息与工程学院 奖学金 状元 8万、榜眼 5万、探花 3万，卓越 1%（约4人）2万，优秀 4%（约16人）1万 暂无信息 提前批面试 有 有 上海交大电院2024级MEM招生优才选拔 复旦信息与工程学院MEM招生简介 2024 MEM 时间线如果准备参加交大 2024 年入学的 MEM 考试，包括提前批面试、笔试、复试，一些关键事项的时间点如下，以交大为例，其他学校略有差异。 时间 关键事项 备注 2023年3月 - 2023年10月 提前批面试 各个批次的具体时间参考 提前批面试 表格 2023年10月5日 - 2023年10月25日 网上报名 2023年12月23日 笔试联考 2024年3月 笔试成绩公布 2024年4月 复试 2024年9月 入学 2027年3月 毕业 提前批面试交大的提前批面试一共有 4 批，每批次的时间安排如下 批次 报名截止时间 面试时间 第一批次 3月20日 四月中上旬 第二批次 5月1日 - 6月5日 六月中旬 第三批次 8月1日 - 9月5日 九月中下旬 第四批次 9月10日 - 10月5日 四月中下旬 面试考核主要包括两部分：考试履历评分和面试表现评分，两个结合得出提前批面试总分。 考生面试材料评分通过不同纬度，评估考生，最终给出是否合适该校 MEM 的招生，影响考生的录取总分。评估的维度相对客观，也存在操作的可能。 教育背景工作履历单位规模&#x2F;地位 世界 500 强 行业龙头企业 部分细分行业龙头企业 个人背景 工作年限 管理经验 下属人数 职务级别 年薪收入 专业资格证书 大学期间获得证书 CET4 &#x2F; CET6 雅思 &#x2F; 托福 工作期间获得 CFA &#x2F; CPA &#x2F; PMP 荣誉奖励 大学期间 工作获得 社会团体 推荐信2封推荐信，了解别人对你的评价，倾向于对自己比较了解的朋友、同事，最好有一定的社会地位，在公司担任一定的管理职务，优先考虑交大的校友。 职业规划了解考生的职业目标是否清晰，报考动机是否合理 论文短述通过短篇论文的方式，了解考生对所在的行业认知，观察考生的领导力，对未来的学习规划。 其他个人特长和兴趣爱好 主要面试内容面试的内容，围绕应聘者提交的材料，考察应聘者的专业背景知识、工作业绩、英语水平、研究计划与职业规划、综合素质。 面试采用 多 v1 的形式，即有三名面试考官，同时对 1 名考生进行考评，单个考生面试时长在 20min ～ 30min 之间，中文为主，有 3min ～ 5min 的英文自我介绍。 面试结果正常情况下，面试后 7 个工作日，会公布面试结果。交大的面试成绩分为三档 A 档：笔试成绩达到交大的合格线，政治考试、体检合格，可获得拟录取资格。参加提前批面试，目标也是为获取拟录取资格，不用再参加复试。 B档：笔试成绩达到交大的合格线，政治考试、体检合格，以笔试分数+优选面试分数（或复试分数）的总成绩排名，同等条件下优先获得拟录取资格（优选面试分数或者复试分数低于120分不录取） 普通档：笔试成绩达到交大的合格线，政治考试、体检合格，以笔试分数+优选面试分数（或复试分数）的总成绩排名，从高到低择优录取（优选面试分数或复试分数低于120分不录取） 笔试笔试包括两场考试，管理类综合和英语，每场考试各 3 个小时。管理类综合共 200 分， 英语 100分，笔试总计 300 分。 管理类综合管理类综合 200 分为 3 部分，数学 75 分、逻辑 60 分、写作 65 分。 数学：25道选择题 逻辑：20道选择题 写作：小作文、大作文 [[MEM 管理类综合考试大纲]] 英语英语 100 分，考察 4 个部分，完形填空 10 分、阅读理解 50 分、翻译 15 分、写作 25 分。 [[MEM 英语考试大纲]] 笔试学习资料教材看到其他同学分享的经验，教材普遍选用的是机械工业出版社的 MBA&#x2F;MEM&#x2F;MPA 通用教材，红皮书。数学 - 陈剑写作 - 赵鑫全逻辑 - 孙勇英语 - 新东方 笔试备考计划工作中习惯了 OKR 工作法，MEM 备考这个事情，有清晰的目标，明确的考核标准，尝试使用 双月OKR 的思路辅助达成最终目标。时间投入：每周最少 15 ~ 20 个小时的备考时间。 周一至周五：1hour × 5 &#x3D; 5hour 周六：5 ~ 10 hour 周日：5 hour 总计：15 ~ 20 hour 从 5月1日 起至 12 月 22 日，总计可投入的备考时间约60hour，换算成自然日（每天8小时）约 62.5天 ～ 82.5天，在 2 个月到 2个半月之间。细算下来，时间不是特别多。 双月备考 OKR围绕数学、逻辑、写作、英语四个方向，以双月维度评估备考计划的完成度。 详细备考计划详细的备考计划还在制作中，会在学习过程中不断完善，整体思路是先数据、逻辑，后英语、写作。 MEM 详细备考计划- WIP版，详细的备考计划还在制定中～，如果有正在备考 2024 年 MEM 的研友，可以添加微信 imesong2012 ，学习讨论，共同进步，携手上岸！","categories":[],"tags":[{"name":"mem","slug":"mem","permalink":"http://imesong.com/tags/mem/"}],"author":"imesong"},{"title":"MEM 管理类综合考试大纲","slug":"MEM 管理类综合考试大纲","date":"2023-05-01T00:00:00.000Z","updated":"2023-05-01T00:00:00.000Z","comments":true,"path":"2023/05/01/MEM 管理类综合考试大纲/","link":"","permalink":"http://imesong.com/2023/05/01/MEM%20%E7%AE%A1%E7%90%86%E7%B1%BB%E7%BB%BC%E5%90%88%E8%80%83%E8%AF%95%E5%A4%A7%E7%BA%B2/","excerpt":"考试性质综合能力考试是为高等院校和科研院所招收管理类专业学位硕士研究生而设置的具有选拔性质的全国联考科目，其目的是科学、公平、有效地测试考生是否具备攻读专业学位所必需的基本素质、一般能力和培养潜能，评价的标准是高等学校本科毕业生所能达到的及格或及格以上水平，以利于各高等院校和科研院所在专业上择优选拔，确保专业学位硕士研究生的招生质量。 考查目标 具有运用数学基础知识、基本方法分析和解决问题的能力。 具有较强的分析、推理、论证等逻辑思维能力。 具有较强的文字材料理解能力、分析能力以及书面表达能力。 考试形式和试卷结构试卷满分及考试时间试卷满分为200分，考试时间为180分钟。 答题方式答题方式为闭卷、笔试。不允许使用计算器。 试卷内容与题型结构 数学基础，75分，有以下两种题型： 问题求解，15小题，每小题3分，共45分 条件充分性判断，10小题，每小题3分，共30分 逻辑推理，30小题，每小题2分，共60分 写作，2小题，其中论证有效性分析30分，论说文35分，共65分","text":"考试性质综合能力考试是为高等院校和科研院所招收管理类专业学位硕士研究生而设置的具有选拔性质的全国联考科目，其目的是科学、公平、有效地测试考生是否具备攻读专业学位所必需的基本素质、一般能力和培养潜能，评价的标准是高等学校本科毕业生所能达到的及格或及格以上水平，以利于各高等院校和科研院所在专业上择优选拔，确保专业学位硕士研究生的招生质量。 考查目标 具有运用数学基础知识、基本方法分析和解决问题的能力。 具有较强的分析、推理、论证等逻辑思维能力。 具有较强的文字材料理解能力、分析能力以及书面表达能力。 考试形式和试卷结构试卷满分及考试时间试卷满分为200分，考试时间为180分钟。 答题方式答题方式为闭卷、笔试。不允许使用计算器。 试卷内容与题型结构 数学基础，75分，有以下两种题型： 问题求解，15小题，每小题3分，共45分 条件充分性判断，10小题，每小题3分，共30分 逻辑推理，30小题，每小题2分，共60分 写作，2小题，其中论证有效性分析30分，论说文35分，共65分 考查内容一.数学综合能力考试中的数学基础部分主要考查考生的运算能力、逻辑推理能力、空间想象能力和数据处理能力，通过问题求解和条件充分性判断两种形式来测试。 试题涉及的数学知识范围有： (一)算术 整数 (1)整数及其运算 (2)整除、公倍数、公约数 (3)奇数、偶数 (4)质数、合数 分数、小数、百分数 比与比例 数轴与绝对值 (二)代数 整式 (1)整式及其运算 (2)整式的因式与因式分解 分式及其运算 函数 (1)集合 (2)一元二次函数及其图像 (3)指数函数、对数函数 代数方程 (1)一元一次方程 (2)一元二次方程 (3)二元一次方程组 不等式 (1)不等式的性质 (2)均值不等式 (3)不等式求解 一元一次不等式(组)，一元二次不等式，简单绝对值不等式，简单分式不等式。 数列、等差数列、等比数列 (三)几何 平面图形 (1)三角形 (2)四边形 矩形，平行四边形，梯形。 (3)圆与扇形 空间几何体 (1)长方体 (2)柱体 (3)球体 平面解析几何 (1)平面直角坐标系 (2)直线方程与圆的方程 (3)两点间距离公式与点到直线的距离公式 (四)数据分析 计数原理 (1)加法原理、乘法原理 (2)排列与排列数 (3)组合与组合数 数据描述 (1)平均值 (2)方差与标准差 (3)数据的图表表示 直方图，饼图，数表。 概率 (1)事件及其简单运算 (2)加法公式 (3)乘法公式 (4)古典概型 (5)伯努利概型 二. 逻辑推理综合能力考试中的逻辑推理部分主要考查考生对各种信息的理解、分析、综合，以及相应的判断、推理、论证等逻辑思维能力，不考查逻辑学的专业知识。试题题材涉及自然、社会和人文等各个领域，但不考查相关领域的专业知识。 试题涉及的内容主要包括: (一) 概念 概念的种类 概念之间的关系 定义 划分 (二)判断 判断的种类 判断之间的关系 (三)推理 演绎推理 归纳推理 类比推理 综合推理 (四)论证 论证方式分析 论证评价 (1)加强 (2)削弱 (3)解释 (4)其他 谬误识别 (1)混淆概念 (2)转移论题 (3)自相矛盾 (4)模棱两可 (5)不当类比 (6)以偏概全 (7)其他谬误 三. 写作综合能力考试中的写作部分主要考查考生的分析论证能力和文字表达能力，通过论证有效性分析和论说文两种形式来测试。 论证有效性分析论证有效性分析试题的题干为一段有缺陷的论证，要求考生分析其中存在的问题，选择若干要点，评论该论证的有效性。本类试题的分析要点是：论证中的概念是否明确，判断是否准确，推理是否严密，论证是否充分等。文章要求分析得当，理由充分，结构严谨，语言得体。 论说文论说文的考试形式有两种：命题作文、基于文字材料的自由命题作文。每次考试为其中一种形式。要求考生在准确、全面地理解题意的基础上，对命题或材料所给观点进行分析，表明自己的观点并加以论证。文章要求思想健康，观点明确，论据充足，论证严密，结构合理，语言流畅。 数学大纲解析数学部分共 25 道选择题，答题时间在 50 min 以内，平均每题 2min。25 道选择题的考查内容分布 考点分布 大纲 考点 题目数量 占比 难度级别 备注 算术 数 1、值 1 2 4% P2 初等数学，基础中的基础 代数 式1、 函数1、方程2、不等式2、数列2 8 32% P0 初等数学 几何 解2、平2、立1 5 25% P1 初等数学 数据分析 排2、概2、据1 5 25% P0 高等数学基础 应用题 比与比例、行程路程、工程、平均值、容斥原理、函数、方程 5 - 8 25% - 40% P1 初等数学 考试特点重视基础难易分布以基础为主，基础（6）：中等（3）：难度（1） 基础知识点 基础公式 基础方法 基础运算 题型灵活 条件充分性判断 数列、几何、应用题 点面结合一题多点，一道题目涉及多个考点 涉及陷阱较多&#x3D;大的陷阱较少，小的陷阱较多 逻辑大纲解析写作大纲解析","categories":[],"tags":[{"name":"mem","slug":"mem","permalink":"http://imesong.com/tags/mem/"}],"author":"imesong"},{"title":"MEM 英语考试大纲","slug":"MEM 英语考试大纲","date":"2023-05-01T00:00:00.000Z","updated":"2023-05-01T00:00:00.000Z","comments":true,"path":"2023/05/01/MEM 英语考试大纲/","link":"","permalink":"http://imesong.com/2023/05/01/MEM%20%E8%8B%B1%E8%AF%AD%E8%80%83%E8%AF%95%E5%A4%A7%E7%BA%B2/","excerpt":"考试性质英语(二)考试主要是为高等院校和科研院所招收专业学位硕士研究生而设置的具有选拔性质的全国统一入学考试科目。其目的是科学、公平、有效地测试考生对英语语言的运用能力，评价的标准是高等学校非英语专业本科毕业生所能达到的及格或及格以上水平，以保证被录取者具有一定的英语水平，并有利于各高等学校和科研院所在专业上择优选拔。 考查内容考生应掌握下列语言知识和技能： 语言知识语法知识考生应能熟练地运用基本的语法知识，其中包括： (1)名词、代词的数和格的构成及其用法;(2)动词时态、语态的构成及其用法;(3)形容词与副词的比较级和最高级的构成及其用法;(4)常用连接词的词义及其用法;(5)非谓语动词(不定式、动名词、分词)的构成及其用法;(6)虚拟语气的构成及其用法;(7)各类从句(定语从句、主语从句、表语从句等)及强调句型的结构及其用法;(8)倒装句、插入语的结构及其用法。 词汇考生应能较熟练地掌握 5500 个左右常用英语词汇以及相关常用词组(详见附录相关部分)。考生应能根据具体语境、句子结构或上下文理解一些非常用词的词义。 语言技能阅读考生应能读懂不同题材和体裁的文字材料。题材包括经济、管理、社会、文化、科普等，体裁包括说明文、议论文和记叙文等。 根据阅读材料，考生应能： (1)理解主旨要义; (2)理解文中的具体信息; (3)理解语篇的结构和上下文的逻辑关系; (4)根据上下文推断重要生词或词组的含义; (5)进行一定的判断和推理; (6)理解作者的意图、观点或态度。 写作考生应能根据所给的提纲、情景或要求完成相应的短文写作。短文应中心思想明确、切中题意、结构清晰、条理清楚、用词恰当、无明显语言错误。","text":"考试性质英语(二)考试主要是为高等院校和科研院所招收专业学位硕士研究生而设置的具有选拔性质的全国统一入学考试科目。其目的是科学、公平、有效地测试考生对英语语言的运用能力，评价的标准是高等学校非英语专业本科毕业生所能达到的及格或及格以上水平，以保证被录取者具有一定的英语水平，并有利于各高等学校和科研院所在专业上择优选拔。 考查内容考生应掌握下列语言知识和技能： 语言知识语法知识考生应能熟练地运用基本的语法知识，其中包括： (1)名词、代词的数和格的构成及其用法;(2)动词时态、语态的构成及其用法;(3)形容词与副词的比较级和最高级的构成及其用法;(4)常用连接词的词义及其用法;(5)非谓语动词(不定式、动名词、分词)的构成及其用法;(6)虚拟语气的构成及其用法;(7)各类从句(定语从句、主语从句、表语从句等)及强调句型的结构及其用法;(8)倒装句、插入语的结构及其用法。 词汇考生应能较熟练地掌握 5500 个左右常用英语词汇以及相关常用词组(详见附录相关部分)。考生应能根据具体语境、句子结构或上下文理解一些非常用词的词义。 语言技能阅读考生应能读懂不同题材和体裁的文字材料。题材包括经济、管理、社会、文化、科普等，体裁包括说明文、议论文和记叙文等。 根据阅读材料，考生应能： (1)理解主旨要义; (2)理解文中的具体信息; (3)理解语篇的结构和上下文的逻辑关系; (4)根据上下文推断重要生词或词组的含义; (5)进行一定的判断和推理; (6)理解作者的意图、观点或态度。 写作考生应能根据所给的提纲、情景或要求完成相应的短文写作。短文应中心思想明确、切中题意、结构清晰、条理清楚、用词恰当、无明显语言错误。 考试形式、考试内容与试卷结构考试形式考试形式为笔试。考试时间为180分钟。满分为100分。 试卷包括试题册和1张答题卡。考生应将英语知识运用和阅读理解部分的答案按要求涂写在答题卡相应题号的选项上，将英译汉和写作部分的答案书写在答题卡指定位置的边框区域内。 试卷结构试题分四部分，共48题，包括英语知识运用、阅读理解、英译汉和写作。 第一部分 英语知识运用主要考查考生对英语知识的综合运用能力。共20小题，每小题0.5分，共10分。 在一篇约350词的文章中留出20个空白，要求考生从每题给出的4个选项中选出最佳答案，使补全后的文章意思通顺、前后连贯、结构完整。 第二部分 阅读理解主要考查考生获取信息、理解文章、猜测重要生词词义并进行推断等方面的能力。该部分由A、B两节组成，共25小题，每小题2分，共50分。 A节(20小题) 本节为单项选择题。共四篇文章，总长度为1500词左右。要求考生阅读文章并回答每篇文章后面的问题。考生需要在每小题所提供的选项(A、B、C、D)中选出唯一正确或是最合适的答案。 每篇文章设5题，共20题。每小题2分，共40分。 B节(5小题) 本节有两种备选题型。每次考试从这两种题型中选择其中的一种形式，或者两种形式的组合进行考查。 本节文章设5小题，每小题2分，共10分。 备选题型包括: 1)多项对应 本节为一篇长度为450~550词的文章，试题内容分为左右两栏，左侧一栏为5道题目，右侧一栏为7个选项。要求考生在阅读后根据文章内容和左侧一栏中提供的信息从右侧一栏中的7个选项中选出对应的5项相关信息。 2)小标题对应 在一篇长度为450~550词的文章前有7个概括句或小标题。这些文字或标题分别是对文章中某一部分的概括或阐述。要求考生根据文章内容和篇章结构从这7个选项中选出最恰当的5个概括句或小标题填入文章空白处。 第三部分 英译汉考查考生理解所给英语语言材料并将其译成汉语的能力。要求译文准确、完整、通顺。 要求考生阅读、理解长度为150词左右的一个或几个英语段落，并将其全部泽成汉语。共15分。 第四部分 写作该部分由A、B两节组成，主要考查考生的书面表达能力。共2题，25分。 A节 考生根据所给情景写出约100词(标点符号不计算在内)的应用性短文，包括私人和公务信函、备忘录、报告等。共10分。 B节 要求考生根据所规定的情景或给出的提纲，写出一篇150间左右的英语说明文或议论文。提供情景的形式为图西、图表或文字。共15分。 英语1 和英语2 的区别适用专业不同只适用英语一的专业 学硕：所有学术硕士全部适用(十三门类)。其中，其它语种、外国语言文学专业第二外语、单独考试外语可由招生单位设置自命题科目，也可选用全国统考科目。 专硕：临床医学（1051）、口腔医学（1052）、公共卫生（1053）等10类专业硕士。 只适用英语二的专业 学硕：无 专硕：工商管理（1251）、公共管理（1251）、会计（1253）等7类专业硕士。 选用英语一或英语二的专业 学硕：无 专硕：金融(0251)、应用统计(0252)、税务(0253)等30类专业硕士。 不适用英语一或英语二的专业 学硕：无 专硕：翻译(0551) 考试题材不同英语一的题材和体裁没有明确限制，英语二要求考生应能读懂不同题材和体裁的文字资料，题材包括经济、管理、社会、文化、科普等，体裁包括说明文、议论文和记叙文等。 试题难度不同英语一与英语二对考生词汇、语法掌握程度的考察深度不同。 英语一和英语二的大纲规定考查词汇范围一致。英语二要求考生较熟练地掌握5500个左右常用英语词汇以及相关常用词组。英语一的考查除满足英语二的要求外，还要求考生掌握词汇之间的词义关系以及词汇生成的基本知识。 英语二大纲规定了总共有八个语法点，而英语一大纲关于语法的规定则较为概念化，没有专门列出对语法知识的具体要求，语法复习范围更为宽泛，任务量较大。","categories":[],"tags":[{"name":"mem","slug":"mem","permalink":"http://imesong.com/tags/mem/"}],"author":"imesong"},{"title":"导出正确的照片时间","slug":"如何导出照片的拍照时间","date":"2023-04-16T00:00:00.000Z","updated":"2023-04-16T00:00:00.000Z","comments":true,"path":"2023/04/16/如何导出照片的拍照时间/","link":"","permalink":"http://imesong.com/2023/04/16/%E5%A6%82%E4%BD%95%E5%AF%BC%E5%87%BA%E7%85%A7%E7%89%87%E7%9A%84%E6%8B%8D%E7%85%A7%E6%97%B6%E9%97%B4/","excerpt":"在备份几年前的旧照片到 iCloud 时，发现导入照片在 iCloud 上的时间线有误，显示为照片的导入时间，而非照片的拍摄时间。照片在拍摄时，有一些元信息存储在 Exif 中，包括拍摄时间、拍摄时间等。在导入 iCloud 时，希望根据照片的拍摄时间进行显示，这样在看到照片时，能够回忆起拍摄时的场景。","text":"在备份几年前的旧照片到 iCloud 时，发现导入照片在 iCloud 上的时间线有误，显示为照片的导入时间，而非照片的拍摄时间。照片在拍摄时，有一些元信息存储在 Exif 中，包括拍摄时间、拍摄时间等。在导入 iCloud 时，希望根据照片的拍摄时间进行显示，这样在看到照片时，能够回忆起拍摄时的场景。 安装 jheadjhead 是一个可以编辑图片元信息到命令行工具。 Jhead is a command line driven program for manipulating the non-image parts of Exif flavour JPEG files that most digital cameras produce. 1brew install jhead Things jhead can extract from an Exif jpeg file Time and date picture was taken Camera make and model Integral low-res Exif thumbnail Shutter speed Camera F-stop number Flash used (yes&#x2F;no) Distance camera was focused at Focal length and calculate 35 mm equivalent focal length Image resolution GPS info, if stored in image IPTC header XMP data Things jhead can modify in an exif jpeg file Up-right images according to rotation tag using jpegtran Set or relative adjust internal exif timestamps Fix date &#x2F; time offsets in large batches of images Re-name or date stamp files according to exif timestamp Transfer exif headers between images Replace thumbnails inside Exif headers Edit jpeg comments (but not the Exif comments) Delete exif or comment sections from jpeg images Create new minimal exif header containing date and thumbnail 查看照片Exif 信息1234567891011jhead 招生信息.jpeg➜ Downloads jhead 招生信息.jpegFile name : 招生信息.jpegFile size : 5164623 bytesFile date : 2023:03:11 16:17:36Resolution : 1024 x 12091JPEG Quality : 100Comment : &#123;&quot;data&quot;:&#123;&quot;activityName&quot;:&quot;&quot;,&quot;imageEffectId&quot;:&quot;&quot;,&quot;filterId&quot;:&quot;&quot;,&quot;product&quot;:&quot;retouch&quot;,&quot;pictureId&quot;:&quot;640AB745-0641-415C-94C3-9F01C11E009A&quot;,&quot;infoStickerId&quot;:&quot;&quot;,&quot;playld&quot;:&quot;&quot;,&quot;stickerId&quot;:&quot;&quot;,&quot;appversion&quot;:&quot;7.2.0&quot;,&quot;os&quot;:&quot;ios&quot;&#125;,&quot;source_type&quot;:&quot;douyin_beauty_me&quot;&#125;======= IPTC data: ======= 修改照片时间1234jhead -ft xxx.jpg// 也可以对当前文件夹下的所有文件修改jhead -ft *.jpg Exif 信息Exchangeable image file format: 可交换图像文件，记录数码相机照片的元信息，包括属性信息和拍摄数据。 标签号Exif 定义名中文定义名备注0x010EImageDescription图像描述0x013BArtist作者0x010FMake生产商0x0110Model型号相机型号0x0112Orientation方向0x011AXResolution水平方向分辨率0x011BYResolution垂直方向分辨率0x0128ResolutionUnit分辨率单位0x0131Software软件固件 Firmware 版本或者编辑软件0x0132DateTime日期和时间照片最后修改时间0x0213YCbCrPositioningYCbCr 定位0x8769ExifOffsetExif 子 IFD 偏移量0x829AExposureTime曝光时间快门速度0x829DFNumber光圈系数光圈的 F 值0x8822ExposureProgram曝光程序自动曝光、光圈优先、快门优先、M 档等0x8827ISOSpeedRatingsISO 感光度0x9000ExifVersionExif 版本0x9003DateTimeOriginal拍摄时间照片拍摄时间0x9004DateTimeDigitized数字化时间照片被写入时间0x9204ExposureBiasValue曝光补偿0x9205MaxApertureValue最大光圈0x9207MeteringMode测光模式平均测光、中央重点测光、点测光0x9208Lightsource光源一般记录白平衡0x9209Flash闪光灯闪光灯状态0x920AFocalLength镜头焦距镜头物理焦距0x927CMakerNote厂商注释0x9286UserComment用户注释0xA000FlashPixVersionFlashPix 版本ColorSpace色彩空间AdobeRGB、sRGB 等ExifImageWidth图像宽度0xA003ExifImageLength图像高度0xA433LensMake镜头生产商0xA434LensModel镜头型号","categories":[],"tags":[{"name":"tools","slug":"tools","permalink":"http://imesong.com/tags/tools/"}],"author":"imesong"},{"title":"Q2-2023-OKR","slug":"Q2-2023-OKR","date":"2023-04-02T00:00:00.000Z","updated":"2023-04-02T00:00:00.000Z","comments":true,"path":"2023/04/02/Q2-2023-OKR/","link":"","permalink":"http://imesong.com/2023/04/02/Q2-2023-OKR/","excerpt":"[[okr-base-2023]]","text":"[[okr-base-2023]] O1 提升客户端架构设计能力，完成通用侧技术架构升级S 客户端 Android Q2 OKR KR1 交易链路技术改造，完成基础框架重构KR2 MVVM 框架演进方案调研，梳理架构演进路线图KR3 学习端到端技术架构，调研业内最佳实践O2 综合能力提升MEM备考计划 KR1 英语 原味英语日常打卡 口语能力提升 定级测试 A2 -&gt; B1 O3 提升写作能力KR1 [[写作工具箱]] 完善，解决写作流程中卡点 [[obsidian]] 图片素材管理 手绘图资源管理 手绘图、思维导图导出的图片更新问题，在 pkm 中比较常见。 KR2 提升写作技巧，补充写作相关的理论知识 [[卡片笔记]] [[渐进式笔记]] [[金字塔原理]] [[逻辑写作笔记]] [[一本小小的红色写作书]] [[麦肯锡教我的写作武器]] O4 幸福感KR1 Hello ,NoraKR2 健康 [[体检小记-2023]]","categories":[],"tags":[{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"}],"author":"imesong"},{"title":"M3-2023-OKR","slug":"M3-2023-OKR","date":"2023-03-18T00:00:00.000Z","updated":"2023-03-18T00:00:00.000Z","comments":true,"path":"2023/03/18/M3-2023-OKR/","link":"","permalink":"http://imesong.com/2023/03/18/M3-2023-OKR/","excerpt":"![[okr-base-2023]] [[2023-OKR]]","text":"![[okr-base-2023]] [[2023-OKR]] O1 客户端技术能力提升 完成半年度技术规划 学习 Jedi 框架，输出总结文档 学习[[电商行业知识]]和专业名词，理解电商业务知识 #复盘技术规划 0.3 ，技术框架 0.3，业务知识学习 0.3 ，总体 0.3 O2 [[personal knowledge management]] v0.1 版本框架搭建完成 采集系统 处理系统 [[写作工具箱]] 能够在实践中应用，初步形成工作流。 #复盘采集系统 0.3， 处理系统 0.3，写作工具箱 0.3， 总体 0.3 O3 完成英语水平能力测试 听力、口语、词汇量等 根据当前英语水平，制定英语学习的计划，包括学习资料、学习方式 #复盘 英语水平能力测试 0.3 学习资料、计划整理 0.0 O4 确定MEM 目标院校、备考节奏 [[MEM 2024 交大 MEM 备考]] 准备提前面试材料 #复盘确定学校、准备备考信息 0.7提前面试材料准备 0.0 O5 幸福感提升 增加理财渠道 至少一周，连续 7 天完成健身环闭合 补充香料相关的理论，整理常用香料的使用技巧 #复盘理财 0.0连续 7 天完成健身环闭合 0.7烹饪理论学习 0.0","categories":[],"tags":[{"name":"2023","slug":"2023","permalink":"http://imesong.com/tags/2023/"},{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"}],"author":"imesong"},{"title":"电商行业知识","slug":"电商行业知识","date":"2023-03-18T00:00:00.000Z","updated":"2023-03-18T00:00:00.000Z","comments":true,"path":"2023/03/18/电商行业知识/","link":"","permalink":"http://imesong.com/2023/03/18/%E7%94%B5%E5%95%86%E8%A1%8C%E4%B8%9A%E7%9F%A5%E8%AF%86/","excerpt":"电商是一个比较复杂的业务 ，电商行业的模型，在各个公司、各个阶段表现不一样。电商业务的参与者，围绕着 人-货-场 解决各个域的问题。","text":"电商是一个比较复杂的业务 ，电商行业的模型，在各个公司、各个阶段表现不一样。电商业务的参与者，围绕着 人-货-场 解决各个域的问题。 人（流量供给）货最终是要卖给人的。没有流量（人），货就没有去向。为什么说阿里电商是流量的黑洞呢？ 货（商品供给）商家、商品端，包括供应链、物流等，都是围绕 B 端提供服务。 场人 与 货 产生关联的地方。在场中，达成人、货交易。 货架电商货架，类似大卖场，商品固定在各个场景中，人在其中浏览、逛、搜索，最终找到想要商品。大卖场里会有不同的专区，有折扣区、会员区、品牌区等。 直播电商直播电商，也是一种场，本质上没有区别，只是在人-货建立关系方式上发生了些许差异。直播场景会提供多种货触达人的方式。通过主播讲解、小黄车、讲解卡、福袋、各种直播道具等。在货架场景，也有货找人的方式，如推送、短信召回，但效率、转换率没有直播高。 线下卖场中，有些商品区域(牛奶、生鲜等)会有推销员介绍一些新品、打折促销活动等。这些场景，和直播电商有类似的功能，主动提供 货-&gt;人的方式，互动性也比较强。 电商指标体系GDP国内生产总值反应一个国家的综合经济能力，中国 100 万亿人民币，非中国家合计 500 万亿人民币，数据来自2022年世界银行统计 社会消费品零售总额：GDP * 社零占比社会消费品零售总额12指企业（单位、个体户）通过交易直接售给个人、社会集团非生产、非经营用的实物商品金额，以及提供餐饮服务所取得的收入金额。个人包括城乡居民和入境人员，社会集团包括机关、社会团体、部队、学校、企事业单位、居委会或村委会等。 以上数据来自国家统计局 官方网站 社零占比 新华社北京5月20日电（记者 谢希瑶、王雨萧）这十年，我国扩内需促消费取得新进展，消费模式不断创新，网络零售市场发展壮大。2021年全国网上零售额13.1万亿元，比2012年增长9倍。2021年实物商品网上零售额10.8万亿元，占社零总额比重达**24.5%**，规模居世界第一。 电商收入电子商务的收入 &#x3D; 社会消费品零售总额 * 货币化率 货币化率 中国 30% 其他国家 10%-30% 不等 电商变现方式 会员费（用户） 消费贷（用户） 佣金（商家） 广告（商家） 物流配送（商家） 支付（商家） 商家融资（商家） 仓储（商家） 供应链提效（商家、生产商） App Store 分成（开发者） 电商行业玩家 Amazon Alibaba JingDong PinDuoDuo eBay SheIn Shoppe Lazada AliExpress Coupang 业务指标GMV**GMV &#x3D; PV * CTR * C_O * AOV = 用户量* ARPU = 流量 * 转化率 * 客单价 PV：流量供给CTR：货的供给、场的转化率、AOV： Average order value ,平均订单价值，客单价 UV 转化率流量供给 UV、PV DAU DAC 电商渗透率 DAC&#x2F;DAU LTV RPD 转化率 CTR CVR 复购率 补贴率 NPS: 净推荐值，评价用户忠诚度 业务知识SKUStock Keeping Unit ,物理上不可分割的最小存货单元。 SKU：土豪金 16G 苹果 6（商品的不可分割的最小单元）。 SPUStandard Product Unit ,商品聚合信息的最小单元，是一组可复用、易检索的标准化信息的集合，描述一个产品的特性。 SPU: 苹果15（商品聚合信息的最小单位），手机→苹果手机→苹果 15，苹果 15 就是 SPU。 CPC: cost per click, 按点击付费。 CPA: cost per action, 按行为、效果付费，单个下载、激活的成本。 CPM : cost per mille , 按千次曝光付费。比较常见的推广方式，99元&#x2F;CPM, 每 1000 个用户看见推广的广告，需要给推广商 99 块。可以有效的增加曝光率。 CPS: cost per sales , 通过实际销售量进行收费，比较适合购物类 App 推广 CPT: cost per time , 通过时间进行收费，类似包月。 LTV：LTV_30,LTV_all，用户生命周期价值，一般会带上时间限制。如 30 天内用户产生的价值。 CAC：customer acquisition cost, 用户获取成本，广告场景下等同于 CPA PBP：payback period ，投资回收期，指从项目投建之日起，用项目的净收益偿还原始投资所需的时间。 ROI: 投资回报率 流量成本 货架电商和直播电商的获客成本，哪个更高？ 直播电商是一种新的营销方式？ 提高营销的效率 降低成本 个人思考 电商的本质是交易用户拥有的金钱、时间、经历 -&gt; 商家的货品、服务 电商系统的三个核心信息流信息发布、信息流转、信息交换的全过程。商品信息的流转，商家 -&gt; 平台 -&gt; 用户；用户决策信息流转，用户 -&gt; 平台 -&gt; 商家。 资金流消费者将钱给到商家的过程，为了解决信任感问题，引入担保交易模式，包括退还等逆向流程。以及在基础交易之上的分佣、分账、出资等 物流商品的流转，将物权从商家转移到消费者手中。跨境物流包括报关、出关、报税等流程。 商品商品的描述 正向交易转化率相关 加购率 立购率 提单率 地址页 支付率 创单率 全链路的转化指标 UG 场景下，影响提单页转化率的核心因素是邮费，是否包邮？商品价格反而不敏感 Question 拼多多为什么没有购物车？","categories":[],"tags":[{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"}],"author":"imesong"},{"title":"personal knowledge management","slug":"personal knowledge management","date":"2023-03-16T00:00:00.000Z","updated":"2023-03-16T00:00:00.000Z","comments":true,"path":"2023/03/16/personal knowledge management/","link":"","permalink":"http://imesong.com/2023/03/16/personal%20knowledge%20management/","excerpt":"个人知识管理系统( Personal Knowledge Management )简称 PKM ，在搭建 PKM 之前，需要回答几个核心的问题 知识是什么？ 信息、知识、技能、经验、智慧有什么区别？ 知识管理的目的是什么？ 一个完备的 PKM，包括信息的采集、处理和输出。pkm 的运行流程如下 在搭建 PKM 过程中，会借助各种工具，不断提高系统的效率、流畅度。","text":"个人知识管理系统( Personal Knowledge Management )简称 PKM ，在搭建 PKM 之前，需要回答几个核心的问题 知识是什么？ 信息、知识、技能、经验、智慧有什么区别？ 知识管理的目的是什么？ 一个完备的 PKM，包括信息的采集、处理和输出。pkm 的运行流程如下 在搭建 PKM 过程中，会借助各种工具，不断提高系统的效率、流畅度。 pkmv0.1 版本的框架如下 采集系统采集系统主要用来收集信息，包括主动获取信息，被动接受信息。信息碎片化愈发严重情况下爱，一个高效的信息采集系统，能够帮助降低信息噪音，屏蔽垃圾信息。 采集系统从不同维度分析，会有多种表现 信息获取介质信息可以通过不同的介质传播，采集系统更需要支持常见的传输介质，包括图文、音频、视频。v0.1版本只支持图文。 信息获取途径工作、生活中，除去睡眠时间，剩下的时间都有 iPhone、Mac 陪伴。信息时代，主要通过手机、电脑获取信息。 在电脑上，习惯使用 Chrome 浏览信息，遇到感兴趣的信息，通过 Save to Notion ，收藏到 Notion 的 Inbox database 中。 滴答小助手2023年5月1日后，非会员不可以使用。udpate 2023年5月8日。 在 iPhone 上，主要通过微信公众号，获取自己感兴趣的东西。感兴趣的内容会分享给 滴答小助手 ，临时存储在 滴答清单 的收件箱中。在其他的 App 中，如掘金，极客时间，Chrome 浏览器等，如果需要采集信息，也都是分享到 滴答清单 ，保存在收件箱中。 在公司内部，也有很多高质量的文章、博客，遇到感兴趣的，先收藏到 Chrome 的 书签栏 ,或者保存快捷方式到个人的飞书文档空间中。 信息的采集主要通过 滴答小助手 公众号 和 Save to Notion Chrome 插件。滴答小助手重点采集 iPhone 端， Chrome 插件采集 Mac 电脑端，相互配合，各有所长。 处理系统信息处理系统名字暂定 Sbrain(第二大脑)，处理系统是IPO 模型( Input→Process→Output)中的 P，是最关键的一个环节。 处理系统中有几个名词，约定如下 Info: 信息，一般指 Notion Inbox 和 滴答清单收件箱中采集的网页文章，临时的想法等，信息的内容可多可少，可大可小，没有经过个人主观的判断。一条 Info 可以产生一个 note，也可能是多个。info 和 note 是多对多的关系。 Note：PKM 系统中的最小节点，具有原子性，可以自解释。 Knowledge：note 的信息经过汇总、整理，可以输出为 knowledge。knowledge 在深入度、广度上有一定的要求。 Project：project 是一个项目，需要经过一系列的 knowledge，持续的输出。 [[卡片笔记]]输出系统在信息处理系统中，已经把输出的方式和流程涵盖了，输出的工具在[[写作工具箱]]中有介绍，主要包括 Notion、Obsidian、 Xmind、PicGo、Excalidraw 、MdNice等。 输出平台包括 [[source&#x2F;_posts&#x2F;hexo|个人网站 imesong.com]] 微信公众号 blog 的发布流程 ![[source&#x2F;_posts&#x2F;hexo#^a5f3af]] 元数据管理元数据的管理，主要包括三个方面 数据备份 数据格式 markdown first ，非必要，不适用其他格式 尽量保留源文件，如流程图的 excalidraw ,xmind 等 数据存储 local first ,本地具有完全的数据权限，能够离线使用。 数据备份源文件备份在两个地方 iCloud github 私人仓库 访问源文件的设备包括个人设备（Mac&#x2F;iPad&#x2F;iPhone）和公司 Mac 办公电脑 个人设备：具有iCloud、github 完整的数据读写访问权限 公司Mac办公电脑：不可以访问 iCloud，现在可以访问 iCloud（update 20230401），具有github私人仓库的读写权限","categories":[],"tags":[{"name":"pkm","slug":"pkm","permalink":"http://imesong.com/tags/pkm/"}],"author":"imesong"},{"title":"say hi 2023","slug":"2023-OKR","date":"2023-03-12T00:00:00.000Z","updated":"2023-03-12T00:00:00.000Z","comments":true,"path":"2023/03/12/2023-OKR/","link":"https://imesong.com/2023/03/05/say%20hi%202023/","permalink":"http://imesong.com/2023/03/12/2023-OKR/","excerpt":"2023 已经过去一个双月了，公司最近完成了 2022 财年（2022&#x2F;3-2023&#x2F;2）的绩效考评，绩效结果预计 4 月中旬出来。这两天反复琢磨推敲，完成了 2023 年度的个人 OKR，希望通过 OKR 的方式 ，新的一年取得更好的绩效。 个人的 OKR ，集中精力在三个方向上，专业技能、复合能力、幸福感。每个方向下有 2-3 个不同的主题（Object），目标不在多少，关键是看，在年底时完成度有多少。 [[专业技能]] 专业技能：解决专业领域内问题、创造价值的能力。 专业领域：移动端、大前端 [[复合能力]] [[写作能力]] [[英语能力]] [[工程管理]] [[幸福感]] [[Healthy]] [[Finance]] [[Cooker]]","text":"2023 已经过去一个双月了，公司最近完成了 2022 财年（2022&#x2F;3-2023&#x2F;2）的绩效考评，绩效结果预计 4 月中旬出来。这两天反复琢磨推敲，完成了 2023 年度的个人 OKR，希望通过 OKR 的方式 ，新的一年取得更好的绩效。 个人的 OKR ，集中精力在三个方向上，专业技能、复合能力、幸福感。每个方向下有 2-3 个不同的主题（Object），目标不在多少，关键是看，在年底时完成度有多少。 [[专业技能]] 专业技能：解决专业领域内问题、创造价值的能力。 专业领域：移动端、大前端 [[复合能力]] [[写作能力]] [[英语能力]] [[工程管理]] [[幸福感]] [[Healthy]] [[Finance]] [[Cooker]] O1 提升大前端领域技术能力，成为一名大前端技术专家KR1：[[客户端技术能力]] Android 专业能力 架构设计能力 KR3：[[跨平台能力：提高通用的跨端研发能力]] 👉 跨端容器，端渲染能力 KR2：[[前端技术能力：中高级的 FE 工程师]] 👉 掌握React前端技术栈，胜任中后台、前端 H5 的业务需求 O2 构建个人知识管理体系V1.0（PKM-V1.0）KR1：信息处理workflow 采集 整理 归纳 输出 KR2：写作能力O3 [[英语学习]]KR1：业务英语胜任工作场景的英语应用 国际化电商相关的专业英语 工程领域内的专业英语 KR2：口语表达能力满足日常会议、面试等场景的； KR3：书写能力使用英文完成工作邮件、总结等； O4 [[工程管理]]KR1: 完善工程管理相关的理论体系，通过 MEM 考试 A 线05 [[幸福感]]KR1：身体健康保持良好的生活习惯，体检指标不劣化 腰椎 体脂率、内脏脂肪等级 睡眠 耳鸣 KR2：增加家庭财务能力，提高抗风险能力提高家庭的财务稳定性，现金流xx 现金流: xxx 理财收益：≥3% 被动收入: xxx KR3：补充烹饪相关的理论知识，提高厨艺技巧 香料 肉类 海鲜类","categories":[],"tags":[{"name":"2023","slug":"2023","permalink":"http://imesong.com/tags/2023/"},{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"}],"author":"imesong"},{"title":"OKR 笔记","slug":"OKR 笔记","date":"2023-03-05T00:00:00.000Z","updated":"2023-03-05T00:00:00.000Z","comments":true,"path":"2023/03/05/OKR 笔记/","link":"","permalink":"http://imesong.com/2023/03/05/OKR%20%E7%AC%94%E8%AE%B0/","excerpt":"O: 设置真正的目标？ 需要思考，什么是真正的目标？真正的目标来自于哪里？愿景？ 不要把完成目标的方式 (TODO)，当作目标本身。 面向绩效，寻找真正的目标。目标完成后，发生了哪些变化？ O 要有方向性。不只是我们要做什么，而且知道做这件事情的背后的深层次的目标、逻辑。完成一个目标的手段（TODO）有很多，我们需要找到最优解。 O 并不强求有量化的指标，有的目标不是完全可以量化的，是针对某个需要达到什么水平的定性表述，需要多个纬度的能力（定量 KR）才能实现。","text":"O: 设置真正的目标？ 需要思考，什么是真正的目标？真正的目标来自于哪里？愿景？ 不要把完成目标的方式 (TODO)，当作目标本身。 面向绩效，寻找真正的目标。目标完成后，发生了哪些变化？ O 要有方向性。不只是我们要做什么，而且知道做这件事情的背后的深层次的目标、逻辑。完成一个目标的手段（TODO）有很多，我们需要找到最优解。 O 并不强求有量化的指标，有的目标不是完全可以量化的，是针对某个需要达到什么水平的定性表述，需要多个纬度的能力（定量 KR）才能实现。 KR: 如何支撑 O 的绩效？ KR是支持 O 实现的方式和路径。达成目标需要哪些能力和条件，然后不停的迭代这些能力和条件。 KR 需要 Task 支撑，最终会落地为一个个的 Task (TODO) 。 KR是真正可衡量的结果，而不是任务。KR 需要从目标出发，分析目前现状和目标差距，是什么能力和条件的缺失，为了达成目标，需要做成哪些结果来证明具备了这些能力和条件。任务型的 KR 可能本末倒置，只有苦劳没有绩效。 KR 符合 SMART。 KR 数量不要过多，3-5 个。 KR的拆分，参考 MECE 法则。 跟踪 OKR：制定再完美、合理的 OKR，不去执行，等于空谈跟踪 OKR 是一个动态的过程，优秀的执行力是一个基本的要求。 OKR的复盘如果 OKR没有达成 1 ，一般需要复盘目标没有完成的原因，可以从以下几个方面思考和回答： 设定 OKR的时候，进行了哪些基本假设？是否还成立？是否需要根据最近的理解更改基本假设？设定的目标是我真正想要的吗？ 基于假设，认为自己应该重点弥补的能力和条件，现在是否变化？还需要具备其他能力吗？ 对于这些能力和条件，我选择的手段和方式是否是最有效的？有没有更有效的方式？ 我发现了哪些做法，效果特别好，接下来可以放大？ 我做了什么，导致 OKR完成情况不符合预期，下个周期怎么避免？ ORK 是一种工具，只有使用起来才能发挥作用。善假于物，而不限于物。 黄勇的OKR实战笔记 链接: https://pan.baidu.com/s/1KQNWE8-R_YyhtyGblmMZ_w 提取码: y3ku 复制这段内容后打开百度网盘手机App，操作更方便哦 –来自百度网盘超级会员v5的分享","categories":[],"tags":[{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"}],"author":"imesong"},{"title":"黄勇的 OKR实战学习笔记","slug":"黄勇的 OKR  实战学习笔记","date":"2023-03-05T00:00:00.000Z","updated":"2023-03-05T00:00:00.000Z","comments":true,"path":"2023/03/05/黄勇的 OKR  实战学习笔记/","link":"","permalink":"http://imesong.com/2023/03/05/%E9%BB%84%E5%8B%87%E7%9A%84%20OKR%20%20%E5%AE%9E%E6%88%98%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/","excerpt":"OKR是什么OKR 的发展历史","text":"OKR是什么OKR 的发展历史 OKR 的基本原则Objectives &amp;KeyResult 目标管理工具 绩效管理工具 沟通工具 人才激励工具 是一个工具,背后代表在一种管理理念和思维方式 OKR的数据结构 OKR 三板斧 制定 OKR：自顶向下地制定目标，自底向上对齐目标。 执行 OKR：唯有做到持续追踪、持续更新，才能做到拥抱变化。 评估 OKR：周期性地评估和复盘，持续改进、持续迭代。 OKR 不仅是目标管理工具，也是激励与沟通工具。 OKR 的概念比较容易理解，但内涵却充满了许多人性和智慧。 OKR 适合在环境多变的时代下，用敏捷精神去拥抱变化。 OKR 与 KPI 区别KPI：Key Performance Indicator(关键绩效指标) OKR：objective &amp; Key Result（目标和关键结果） 关注对象：OKR 关注的是目标是否达成，而 KPI 关注的却是结果是否完成。OKR 的目标野心勃勃和无限挑战，而 KPI 体现的是制定的指标是否可以达标。 核心原理：OKR 的核心原理在于“目标对齐”，而 KPI 的核心原理却在于“指标分解”。 实操过程：OKR 是鼓励员工自己去制定目标，能激发其主观能动性，而 KPI 却是领导去下达指标，员 工去接受任务，中间难免会有“讨价还价”的过程。 用户行为：OKR 让我们更愿意主动地挑战，而 KPI 却让我们不得不被动地执行。 利益关联：OKR 与利益不直接相关，而 KPI 却与利益挂钩。 OKR 可以取代 KPI 吗？OKR 是目标管理工具，KPI 是绩效管理工具，那么在管理中所有的目标是绩效吗？ 目标包括绩效，但不局限于绩效。绩效是组织期望的结果，但目标还包括个人成长 推算型工作更适合用 KPI，探索型工作更适合用 OKR。 OKR 与 KPI 关注点不同，前者更注重过程，后者只在意结果。 OKR 无法取代 KPI，也没有必要取代 KPI。 需要充分发挥我们身上的领导力，将 OKR 与 KPI 相结合，让价值最大化。 OKR 落地的条件面对沟通时，是否公开透明 在目标“制定”过程中，通过跟自己的上级、平级、下级沟通，从而实现目标对齐。 在目标“执行”过程中，我们需要不断跟踪目标的进度，一旦有调整就需要及时沟通。 在目标“评估”过程中，我们需要对目标进行评估和复盘，需要跟团队一起开会讨论，这又会产生更进一 步的沟通。 面对交付时，是否信守承诺当我们制定 OKR 时，本质上就是在制定目标，而这些目标很大程度上，恰恰代表了我们自己对团队的一种承诺。 如果我们在制定OKR 时已经做出了承诺，而后又很随意地推翻了当初的承诺，最终对此事也没有跟大家同 步想法，更没有什么有效反馈，不过是几句轻描淡写，此事就这样过去了。那么，OKR 的价值实便不存在 了 面对压力时，是否勇于挑战当你制定 OKR 时，如果都是按照自己最安全的角度来制定目标的话，多数会出现这样一种现象：最终，根 据你所制定出的OKR 评分标准，大家几乎都能拿满分。 它所暴露出来的本质问题：这样也就把 OKR 做成“自定义 KPI”了， 从而很大程度上失去了使用 OKR 的实际意义。 团队内驱力强的团队，非常适合 OKR。 从 个人成长、团队贡献两个角度考察团队内驱力 OKR 对内驱力强的人有价值，我们应该先让那 20% 的人用上 OKR，再去努力提升他们的领导力，最后让他们影响剩余 80% 的人，最终大家顺理成章地就都用上了 OKR。 OKR 是自驱力较强的人自我成长的利器。 OKR 怎么对齐对齐一定 是 O 与 O 之间的支撑关系，与 KR 没有任何直接关系。 OKR 的目的在于“聚焦”，而手段在于“对齐”，我们需要深刻理解“对齐”二字的真实含义，以 及“对齐”与“分解”的区别，这对我们实践 OKR 起到了至关重要的作用。 我们做任何事情（包括加班）都要有目标，凡是有目标的，就能使用 OKR。 制定 OKR 绝不是拿团队的 KR 作为自己的 O，而是用自己的 O 去对齐团队的 O。 公司每个人都要有自己的“个人 OKR”，我们都应该为自己所在的团队而贡献力量。 如何制定 OKRObjectivesO 是 OKR 中“What”的层面，它解决了“做什么”的问题。 O 尽可能要以动词形式开头。 O用通俗易懂的语言来表达。 O 最好能附上一句目标描述。 2021 年 Q1 团队目标 O1：打造能让每个人都喜爱的工程师文化 描述：希望能提升工程师团队的凝聚力，让每个人在团队中都能得到成长，并为加入我们的团队而感到骄傲，因此，我希望大家能一起打造让我们团队每个人都喜爱的文化。 KeyResultKR 是针对OKR 中“How”的层面，它解决了具体“怎么做”的问题。O 是定性的，KR 是定量的。 KR 对 O具有支撑作用。KR完成了，O 也应该完成。 KR 的三条核心原则 KR要支撑目标，需要与 O 直接关联。 KR 用数据说话，需要通过数据去度量，符合 SMART 原则。 KR 具备挑战性，难易度设置需要恰到好处。 KR 制定时注意事项 KR 需要通过努力才可能完成。可能是实现难度较大，或者是它的时间成本较大。 KR 不是日常工作或行动计划。实际上，KR 是完成一系列任务后才能得到的结果。 KR 必须要具备良好的实操性。当写完一条 KR 后，试着经常问自己“这条KR应该如何去实操呢？”。 O 要能聚焦。既要明确方向，又要激励人心。 KR 要有意义。既要能够度量，又要能够支撑目标。 OKR 制定过程，可以将其视为一个项目，并从项目管理中追求效率的提升。 OKR的执行动态变化的，需要定期回顾执行情况 建议我们做到“每天更新、每周回顾、每月优化、每季复盘”。具体来说就是，每天更新自己的 OKR 完 成进度，每周对自己的 OKR 做一次回顾，每月对自己的 OKR 做一次优化，每季对团队和个人的 OKR 分 别做一次复盘，逐渐养成习惯。 建议在周会上每个人向团队同步一次自己的 OKR 执行进度，让彼此之间能看到各自的 OKR 在往前进行， 每个人充分享受成长和贡献所带来的快乐。 建议每月我们开一次 OKR 交流会，在会上允许对自己的 OKR 内容进行更新，若其他人的 OKR 可能受影 响时，我们就在这次会上进行探讨。 你可以不修改任何内容、进度、信心指数，但一定要每周做一次查看和思考 OKR高效执行的方法 OKR 需要设一个固定的执行周期，我们可以将此周期定为 2 个月。 将 OKR 制定完毕后，必须定期对它的内容、进度、信心指数进行更新和同步，这样才能最大化避免 OKR 更新不及时，从而导致信息不对称的风险。 只有将 OKR 与自己的日常工作任务关联起来，并通过任务去驱动 OKR 完成，才能提高执行效率，达到高效。 将任务与 OKR 之间看成是一个“二级驱动”关系，即任务驱动 KR 的完成，进而促使KR 驱动 O 的达成。 执行力有多强取决于领导力有多强，而领导力需要在立即作出决策时发挥作用。 无论使用多么先进的工作法，缺乏有效的过程跟踪，就是在给自己挖坑。 在团队中引入OKR，一定要和原有工作流相结合，OKR才能顺利落地。 OKR 评估简化OKR评估标准 1.0 分：不可能做到，但实际做到了。 0.7 分：希望能做到，实际也做到了。 0.3 分：肯定能做到，实际也做到了。 0 分：肯定能做到，但实际没做到。 举个例子，以你自己的经历来看，一个月最多只能精读 1 本书，而你希望一个月可以花更多的时间去阅读，因此你可以制定这样的 OKR： O：充分享受阅读所带来的乐趣 KR：一个月看 5 本书 这个 KR 对于你目前而言是不可能做到的，如果你实际上做到了，在 OKR 评估时，你就可以对该 KR 评 1.0 分，因为这件事儿对于你的挑战简直是超乎想象的，结果你却奇迹般地做到了。 如果你将 KR 写为“一个月看 1 本书”，这是你肯定能做到的事情，加入你实际上却没做到的，那么就只 能评 0 分；如果做到了，就只能评 0.3 分，因为这是你力所能及的事情，对你而言几乎没有什么挑战，那 么评分也不可能很高。 如果你认为应该去挑战一下自己，但又不希望最终的结果离期望相差太远，那么你可以将 KR 写为“一个 月看 3 本书”；如果你做到了，那么你也只能得 0.7 分，因为挑战还不够大，你的得分也不会很高。 OKR 评分标准的定义，没有太多的分值选项设置，只有 0、0.3、0.7、1.0 四种分值选项，你只需给自己一定挑战，最后根据客观事实做出评估即可。 OKR 评估方式就是自评，而OKR 评估也是自我管理的有效手段。 OKR 评估必须落实和体现在自我层面上，自己制定的 OKR 就需要由自己去评估。 让复杂过程简单化，OKR 评分其实根本没有想象中那么难。 OKR 评估过程在本质上是对自我管理的一种体验，进而提升管理能力，这都需要从自我评估开始。 OKR 评估是给自己看的，而不是给别人看的，更不是拿来做比较的，我们应该为自己所制定的目标负责 OKR 复盘 审视目标 回顾过程 分析得失 总结规律 审视目标为何当初你要制定这样的目标，而不是其他目标？你所制定的目标现在达成了吗？如果没达成，现实和预期之间的差距在哪里呢？ 回顾过程整个目标执行过程是如何执行的？你大致分为几个阶段去执行？每个阶段中发生了什么重要事件？ 分析得失在这次在这次 OKR 周 期中，哪些方面你做得很好？为什么好？哪些方面你做得不够好？为什么不好？ 总结规律如果再次做同类事情，如果再次做同类事情，你会怎么去做？对我们后续的工作有何指导？我们收获了哪些规律、原则、方法论？ 复盘能帮助你看清 OKR 执行过程中的每一个步骤，帮助团队深刻体会 OKR 所带来的价值。 复盘不是简单地回顾和总结，需要借助一套严谨且合理的方法论，才能让复盘变得更有意义。 如果 OKR缺少了复盘，不仅会让你频繁踩坑，还会让你失去一次锻炼和展示自己领导力的绝佳机会。 技术团队的价值项目管理的价值仅在于让项目顺 利上线，至于项目是否产生应有的价值，似乎就无法控制了。 向上管理向上管理，管理的其实是领导对你的期望。 1.做⼀名“被领导者”，需要发挥⾃⼰的智慧，充分挖掘出领导对你的期望。 2.产品经理管理的是⽤⼾对产品的期望，你需要管理的是领导对你的期望。 3.OKR是⼀种管理思维，只要双⽅认可OKR的价值，就能快速达成共识。 中层管理企业的发展⽅向取决于创始⼈，但企业的经营节奏却取决于管理者。尤其对于中层管理者⽽⾔，上 有⾼层领导，下有基层团队。更加形象地来说，⾼层领导是企业的“头部”，基层团队是企业的“腿部”， 那么中层管理者就是企业的“腰部”。 中层腰虚的表现 团队执⾏⼒不强。⾼层说中层缺乏能⼒，中层说基层能⼒不够，对下级总是不认可。 ⾼层对基层交付结果不满。⾼层认为是中层没传达好，中层说是基层没执⾏好。 基层出现⽆法解决的问题。久⽽久之，就会逐级上升，直到⾼层介⼊，⾼层会认为中层能⼒不⾏。 中层之间关系不和谐。经常互怼，甚⾄相互伤害，所带领的团队也出现“抱团”现象。 中层抗压⼒不够或内⼼不够强⼤。经常给基层制造负⾯情绪，导致团队吐槽不断。 OKR 落地过程中常见问题OKR只是一个目标管理工具，这个工具在团队中是否能够发挥作用，发挥怎么样的作用，完全取决 于使用工具的你 将 OKR 用于绩效考核 用 KPI 思维做 OKR O 数量太多，不够聚焦、 KR 不够量化，无法评估 将 KR 当成行动计划或待办任务 忽略 OKR 向上对齐和水平对齐 忽略 OKR 更新和复盘 忽略 OKR 评分环节 认为 OKR 可取代 KPI OKR 不与绩效考核相关，不与奖金或薪资直接挂钩。 OKR 是公开透明的，每个人都能看到所有人的 OKR。 OKR 要有评分，评分不是越高越好，越高说明挑战越不够。 OKR 目的在于让事情变得聚焦，在正确的轨道上做出努力。 OKR 是工作法，也是管理方法，它能激励团队取得成功。 OKR 需做出承诺并付出行动，它是思想，也是文化。 链接: https://pan.baidu.com/s/1KQNWE8-R_YyhtyGblmMZ_w 提取码: y3ku 复制这段内容后打开百度网盘手机App，操作更方便哦 –来自百度网盘超级会员v5的分享","categories":[],"tags":[{"name":"readingnotes","slug":"readingnotes","permalink":"http://imesong.com/tags/readingnotes/"},{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"}],"author":"imesong"},{"title":"say bye 2022","slug":"say bye 2022","date":"2023-03-01T00:00:00.000Z","updated":"2023-03-01T00:00:00.000Z","comments":true,"path":"2023/03/01/say bye 2022/","link":"","permalink":"http://imesong.com/2023/03/01/say%20bye%202022/","excerpt":"2022 已经过去一个双月，最近完成公司 2022 年度（2022&#x2F;3-2023&#x2F;2）的 360 。过去一年好似发生了很多、经历了很多，在总结时，又发现没有啥收获，不知道都做了什么。 不念过往、不惧将来","text":"2022 已经过去一个双月，最近完成公司 2022 年度（2022&#x2F;3-2023&#x2F;2）的 360 。过去一年好似发生了很多、经历了很多，在总结时，又发现没有啥收获，不知道都做了什么。 不念过往、不惧将来 工作感受 专业技能边界有扩展，熟悉了前端的技术栈，掌握公司内部的跨端开发框架Lynx，能够完成基础的跨端业务开发 客户端的开发技能基本无变化，把之前忘记的东西捡回来了一些 架构设计能力、性能优化、解决疑难问题的经验，有收获但不成系统 个人心态 真实的面对个人的感受，包括负向的反馈：焦虑、烦躁、自卑等 抗压能力，过压时要学会反馈，请求帮助","categories":[],"tags":[{"name":"summary","slug":"summary","permalink":"http://imesong.com/tags/summary/"},{"name":"2022","slug":"2022","permalink":"http://imesong.com/tags/2022/"}],"author":"imesong"},{"title":"obsidian","slug":"obsidian","date":"2023-02-27T08:39:01.000Z","updated":"2023-02-27T08:39:01.000Z","comments":true,"path":"2023/02/27/obsidian/","link":"","permalink":"http://imesong.com/2023/02/27/obsidian/","excerpt":"1尽可能简化配置，开箱即用，非必要不定制 卡片笔记和 [[obsidian]] 结合，最佳实践 canvas 插入到notes 中预览，无法看到节点中的文字 Mac 原生键盘，如何输入 左上角的顿号，行内潜入 代码块","text":"1尽可能简化配置，开箱即用，非必要不定制 卡片笔记和 [[obsidian]] 结合，最佳实践 canvas 插入到notes 中预览，无法看到节点中的文字 Mac 原生键盘，如何输入 左上角的顿号，行内潜入 代码块 SettingsTemplate根目录 /blog/ 下新建目录 _obsidian_template 存放模板文件 header_template , blog metadata okr-base-2023 readnotes_template Files&amp;LinksDefault location for new notes : 根目录调整为 -&gt; Draft Hotkeys自定义的快捷键 插入模板 cmd + i Community plugins File Tree Alternative Plugin： 开箱即用 Image Auto Upload Plugin Tasks：调试中，开箱即用, 无特殊配置 Advanced Table: 使用表格时，必须是在英文状态下输入 ｜ 才可以，在中文状态下输入，无法使用 Tab 键跳转到下个Cell iCloud 备份 iCloud 目录 1~/Library/Mobile Documents/iCloud~md~obsidian/Documents/blog .zshrc 定义alias 12alias tblog=&#x27;cd ~/Library/Mobile Documents/iCloud~md~obsidian/Documents/blog&#x27; 资源管理图片资源管理 通过 [[PicGo]] 上传到七牛 OSS ，自建图床，本地不保留原文件 手绘图原文件，包括 [[excalidraw]]、xmind 等原文件，通过 iCloud，创建单独的文件夹管理同步。这些有再次编辑、更新的可能，需要保存原文件。","categories":[],"tags":[{"name":"tools","slug":"tools","permalink":"http://imesong.com/tags/tools/"}]},{"title":"hexo","slug":"hexo","date":"2023-02-27T08:35:01.000Z","updated":"2023-02-27T08:35:01.000Z","comments":true,"path":"2023/02/27/hexo/","link":"","permalink":"http://imesong.com/2023/02/27/hexo/","excerpt":"背景最近在整理资料时，发现2年前备份的hexo 网站的 md 源文件，才发现，自己的个人站点，已经2年多没有更新了，上次更新还是在2020年，在前司的办公电脑上操作的。趁着最近整理资料的契机，将个人博客重新部署、升级。 目标 迁移 hexo 源文件、配置 升级hexo 版本、Next 主题版本 CI&#x2F;CD ,github page 自动更新 ^832567 hexo 源文件，相关的配置备份;源文件多端同步，能够在不同的电脑、终端编辑博客 多平台发布 hexo博客 微信公众号","text":"背景最近在整理资料时，发现2年前备份的hexo 网站的 md 源文件，才发现，自己的个人站点，已经2年多没有更新了，上次更新还是在2020年，在前司的办公电脑上操作的。趁着最近整理资料的契机，将个人博客重新部署、升级。 目标 迁移 hexo 源文件、配置 升级hexo 版本、Next 主题版本 CI&#x2F;CD ,github page 自动更新 ^832567 hexo 源文件，相关的配置备份;源文件多端同步，能够在不同的电脑、终端编辑博客 多平台发布 hexo博客 微信公众号 hexo 文件迁移翻箱倒柜，从移动硬盘上找到了3年前备份的hexo目录，当时保险起见，把整个安装包备份了下来。hexo 博客下面几个目录&#x2F;文件比较关键，只要这几个东西在，就能快速的重新把hexo搭建起来。 source 目录下的源文件 config 配置文件 theme 中的主题配置文件 package.json node 依赖 把之前备份的整个目录 copy 到现在电脑上，删除 node_modules 目录 执行 npm install 安装相关依赖 npm install hexo-cli-g hexo server , 惊喜的发现，本地可以直接运行起来。有一个多语言适配的问题，后面再解决。 hexo 版本升级hexo 版本升级过程比较简单，主要是更新相关的依赖内容升级之前的版本信息 123456789101112131415161718192021222324252627282930➜ imesong hexo version(node:41891) Warning: Accessing non-existent property &#x27;lineno&#x27; of module exports inside circular dependency(Use `node --trace-warnings ...` to show where the warning was created)(node:41891) Warning: Accessing non-existent property &#x27;column&#x27; of module exports inside circular dependency(node:41891) Warning: Accessing non-existent property &#x27;filename&#x27; of module exports inside circular dependency(node:41891) Warning: Accessing non-existent property &#x27;lineno&#x27; of module exports inside circular dependency(node:41891) Warning: Accessing non-existent property &#x27;column&#x27; of module exports inside circular dependency(node:41891) Warning: Accessing non-existent property &#x27;filename&#x27; of module exports inside circular dependencyhexo: 4.2.1hexo-cli: 4.3.0os: darwin 21.6.0 12.6node: 18.7.0v8: 10.2.154.13-node.9uv: 1.43.0zlib: 1.2.11brotli: 1.0.9ares: 1.18.1modules: 108nghttp2: 1.47.0napi: 8llhttp: 6.0.7openssl: 3.0.5+quiccldr: 41.0icu: 71.1tz: 2022aunicode: 14.0ngtcp2: 0.1.0-DEVnghttp3: 0.1.0-DEV 看了下 hexo 官网 最新的版本已经升级到了 6.3。升级过程如下 123456789101112131415161718192021222324252627282930//以下指令均在Hexo目录下操作，先定位到Hexo目录//查看当前版本，判断是否需要升级&gt; hexo version//全局升级hexo-cli&gt; npm i hexo-cli -g//再次查看版本，看hexo-cli是否升级成功&gt; hexo version//安装npm-check，若已安装可以跳过&gt; npm install -g npm-check//检查系统插件是否需要升级&gt; npm-check//安装npm-upgrade，若已安装可以跳过&gt; npm install -g npm-upgrade//更新package.json&gt; npm-upgrade//更新全局插件&gt; npm update -g//更新系统插件&gt; npm update --save//再次查看版本，判断是否升级成功&gt; hexo version Next 版本升级主题的升级过程稍显复杂，Next 主题从 7.8 版本升级到最新的 8.2 , 中间有 break changes，有一些配置文件需要手动 copy。升级步骤参Next官方文档。 [!NOTE] Breakking ChangesThere are some breaking changes that need attention when upgrading across versions. Update language configuration (for Simplified Chinese)Since v6.0.3, zh-Hans has been renamed to zh-CN: https://github.com/theme-next/hexo-theme-next/releases/tag/v6.0.3Users upgrading to v6.0.3 and later need to explicitly modify the language configuration in Hexo config file, otherwise the language display is incorrect. Since v8.0.0, all libraries under the next/source/lib directory was moved out to @next-theme&#x2F;plugins. Please see this article for the new 3rd-party libraries installation method: Adding Plugins. [!NOTE] Next 主题官方升级步骤NexT suggest to upgrade from version 5 or 7 to version 8 in this way: You need to do some copies of old NexT files:1.1. _config.yml or next.yml (if you used Alternate Theme Config).1.2. Custom CSS files placed in next/source/css/_custom/* andnext/source/css/_variables/* directories.1.3. Custom layout files placed in next/layout/_custom/*.1.4. Any another possible custom additions which can be found by compare tools between repositories. Then rename the old NexT folder, for example, rename next to next-old. Install the new version according to the method provided in this article: installation instructions. Run hexo clean and hexo s to check whether the site works correctly. Update Hexo and Hexo pluginIf after completing the above steps, an error occurs when executing hexo s or hexo g, it means that there may be a conflict between the old version of Hexo &#x2F; Hexo plugin and the new version of the theme NexT. We recommend upgrading Hexo and Hexo plugins to the latest version. You can run npm outdated to see all the upgradeable plugins. If you see any bugs or you simply does not like this version, you can switch back to the old version at any time. github action CI&#x2F;CD 自动部署博客^bc6fa0 github action 的介绍，可以参考官网。通过 github 提供的 CI&#x2F;CD 的能力，自动部署blog的工作流程如下： ^a5f3af 整体流程介绍 本地完成文章编辑，通过 git push 提交变更到私有仓库 imesong&#x2F;blog imesong&#x2F;blog 的 github action 捕捉到 push 事件，触发自动部署流程 部署流程完成后，将编译产物 push 到 imesong&#x2F;imesong.github.io 的公共仓库 再次访问 imesong.com 时，会自动更新到最新的部署内容 github action 配置 imesong&#x2F;blog 的仓库需要配置 github action 的能力，在项目的根目录下新建 .github/worflows/deploy.yml 的文件。github 会根据 deploy.yml 中配置的脚本，执行 workflow。 完整的脚本内容如下，具体的解释可以看官方文档。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950name: Deployon: push: branches: - &#x27;main&#x27;jobs: build: runs-on: ubuntu-latest name: A job to deploy blog. steps: - name: Checkout uses: actions/checkout@v1 with: submodules: true # Checkout private submodules(themes or something else). # Caching dependencies to speed up workflows. (GitHub will remove any cache entries that have not been accessed in over 7 days.) - name: Cache node modules uses: actions/cache@v1 id: cache with: path: node_modules key: $&#123;&#123; runner.os &#125;&#125;-node-$&#123;&#123; hashFiles(&#x27;**/package-lock.json&#x27;) &#125;&#125; restore-keys: | $&#123;&#123; runner.os &#125;&#125;-node- - name: Install Dependencies if: steps.cache.outputs.cache-hit != &#x27;true&#x27; run: npm ci # Deploy hexo blog website. - name: Setup hexo env: ACTION_DEPLOY_KEY: $&#123;&#123; secrets.HEXO_DEPLOY_SECRET &#125;&#125; run: | mkdir -p ~/.ssh/ echo &quot;$ACTION_DEPLOY_KEY&quot; &gt; ~/.ssh/id_rsa chmod 600 ~/.ssh/id_rsa ssh-keyscan github.com &gt;&gt; ~/.ssh/known_hosts git config --global user.email &quot;imesong@126.com&quot; git config --global user.name &quot;imesong&quot; npm install hexo-cli -g npm install - name: Hexo deploy run: | hexo clean hexo generate --d 私有仓库要能够向公共仓库 push 代码，需要在私有仓库配置一个 secret key, 在 public repo 配置一个 deploy key 使用 bash 命令，创建一个新的 ssh 秘钥1$ssh-keygen -f hexo-deploy-key 命令执行成功后，会在当前文件夹下生成 hexo-deploy-key 和 hexo-deploy-key.pub 两个文件。 登陆 public repo 在 settings 中找到 Secrets 新增一个 Secrets TITLE : HEXO_DEPLOY_SECRETVALUE: hexo-deploy-key 中的内容 打开 public repo, 新增一个 deploy key 完成之后，编辑 blog ,push 之后查看 github action 执行情况 多端同步 github 备份 iCloud 备份 https://zhuanlan.zhihu.com/p/119483271 https://github.com/HaoChuan9421/nosync-icloud 多平台发布多平台发布现在是个伪需求，当前最主要的是提高 blog 的更新频率和文章质量 文章在 Obsidian 中编辑好以后，发布 hexo ，生成固定链接，然后再讲文件 copy 到 mdnice 重新排版，调整样式适合微信公众号，最后复制到微信公众号发布。 Q&amp;AleanCloud 报错Q: 使用 leanCloud 统计文档的阅读次数，更新完主题后，出现 Counter not initialized! See more at console err msg. A: 解决方案有两种，最简单的方法，设置 leanCloud 的 security 插件为 false 123456789101112leancloud_visitors: enable: true app_id: xxxx app_key: xxxx # Required for apps from CN region server_url: # &lt;your server url&gt; # Dependencies: https://github.com/theme-next/hexo-leancloud-counter-security # If you don&#x27;t care about security in leancloud counter and just want to use it directly # (without hexo-leancloud-counter-security plugin), set `security` to `false`. security: false 参考资源https://zhangferry.com/2022/07/24/github_action_for_blog_deploy/ https://makefile.so/2021/11/28/use-github-actions-to-deploy-hexo-blog/","categories":[],"tags":[{"name":"tools","slug":"tools","permalink":"http://imesong.com/tags/tools/"}]},{"title":"say bye 2021","slug":"say bye 2021","date":"2022-03-05T00:00:00.000Z","updated":"2022-03-05T00:00:00.000Z","comments":true,"path":"2022/03/05/say bye 2021/","link":"","permalink":"http://imesong.com/2022/03/05/say%20bye%202021/","excerpt":"💡 进入宇宙厂将近一年的时间（2021&#x2F;05-2022&#x2F;04）,在这一年中，外部和内部环境都发生很大的变化，学习了很多新的知识，接触了一些之前未曾了解过的领域，最近业务又有调整，刚好有一段时间的空窗期，借此机会总结下过去一年的工作，希望未来能够做的越来越好。","text":"💡 进入宇宙厂将近一年的时间（2021&#x2F;05-2022&#x2F;04）,在这一年中，外部和内部环境都发生很大的变化，学习了很多新的知识，接触了一些之前未曾了解过的领域，最近业务又有调整，刚好有一段时间的空窗期，借此机会总结下过去一年的工作，希望未来能够做的越来越好。 工作方式扁平化的工作方式，很多事情需要自己主动推动，争取落地的资源。每个人都有自己的 OKR，在工作中如何获其他同学的支持，成为事情能否顺利推进的关键。 OKR 全新的目标&amp;绩效管理工具主动规划，注重承诺，言出必行，使命必达。 团结同学，把事情做好。 Do by yourself需要投入到具体的 coding 工作，对接需求，讨论需求细节 技术 Owner技术负责人，涵盖需求前期的对接到需求线上数据观察全流程。 专业能力 移动端的业务开发能力 前端领域的业务开发能力 业务能力，业务分析和分解能 综合能力 沟通协作 学习能力","categories":[],"tags":[{"name":"summary","slug":"summary","permalink":"http://imesong.com/tags/summary/"},{"name":"2021","slug":"2021","permalink":"http://imesong.com/tags/2021/"}],"author":"imesong"},{"title":"终身幼儿园","slug":"终身幼儿园","date":"2021-10-02T00:00:00.000Z","updated":"2021-10-02T00:00:00.000Z","comments":true,"path":"2021/10/02/终身幼儿园/","link":"","permalink":"http://imesong.com/2021/10/02/%E7%BB%88%E8%BA%AB%E5%B9%BC%E5%84%BF%E5%9B%AD/","excerpt":"💡 Scratch 创始人，MIT 媒体实验室学习研究教授，乐高教育全球董事，乐高教育理念奠基人之一。","text":"💡 Scratch 创始人，MIT 媒体实验室学习研究教授，乐高教育全球董事，乐高教育理念奠基人之一。 创造性学习现在的小学生，大概有2&#x2F;3会在将来从事目前尚未发明出来的工作。要想在变化如此快速的世界蓬勃发展，创造性地思考和行动的能力变得前所未有的重要。 从 A 型人到 X 型人 A 型：墨守成规、循规蹈矩、执行、顺从 X 型：创造性、开放型 像幼儿园那样学习世界上第一家幼儿园—&gt; 玛丽亚·蒙台梭利 💡 当弗里德里希·福禄贝尔于1837年在德国开办了世界上第一家幼儿园时，它不单单是一所幼儿的学校，更是一种与以前的学校教育截然不同的教育方式 4P 学习理论 Project:创建项目是Scratch社区的核心活动。当MahoAshley使用Scratch的时候，她不断地创建项目，并不断地通过创造性学习螺旋，深入了解了创造过程。 Passion:当人们致力于自己关切的项目时，常常愿意花更多的时间，更加努力地工作 Peer: 人们合作、分享并建构彼此的作品 Play: 有趣的实验来培养年轻人的创造力，鼓励他们冒险尝试新事物 创造力是什么，不是什么对创造力的误解 创造力只是一种艺术表达 只有一小部分人有创造力 创造力来源于洞察力 创造力无法被教授 创造力来源于某一类别的艰苦工作，那综合了好奇的探索、有趣的实验和系统的调查。新想法和新见解看起来就像是闪电般突然出现的，但它们通常发生在想象、创造、游戏、分享和反思的许多个周期之后，也就是在经历了创造性学习螺旋的多次迭代之后才会出现。 所有孩子与生俱来都具有创造的潜能，但是他们的创造力并不一定能够自行发展，而是需要培养、鼓励和支持。 Project项目是 创造性学习的基本单位，是体验和参与创造性学习的全新途径。当孩子沉浸在项目的创造和制作中时，才有机会成长为创造型思考者。 通过创造来学习，Learning by doing。 🤵🏼‍♂️西蒙·派珀特（Seymour Papert） 计算机不是教师的替代品，而是一种新的表达手段，一种制造事物的新工具 在学习编程的过程中，孩子们“既获得了一种对最现代、最强大的技术的掌控感，又与科学、数学以及知识模型建构艺术的一些最深刻思想建立了密切的联系” 编程是一种流畅的表达方式 如何判断哪些玩具对你的孩子好呢？ 不要问这个玩具能为你的孩子做些什么，要问你的孩子能拿这个玩具做些什么。 和能够思考的玩具相比，能引人思考的玩具才是我的兴趣所在。如果孩子们可以用这个玩具去想象和创造他们自己的项目，让自己沉浸在创造性学习螺旋中，那么这就是能让我感到兴奋的好玩具。 写作和编程都是一种表达方式，是与他人交流思想的方法 表达得更流畅，无论是通过写作还是通过编程，都可以帮助你开发思维，发出自己的声音，并培养你的身份认同感。 Passion兴趣和内在动机才是创造力和长期坚持的关键，教育不是灌满一桶水，而是点燃一把火。 低地板、高天花板、宽围墙 当人们从事自己感兴趣的项目时，他们会更加积极，愿意投入更多的时间，付出更多的努力。不止如此，热情和动力让他们更有可能迸发出新的想法，发展出新的思维方式。 最好的学习经历包括了沉浸和反思相互交替的阶段，热情是驱动“沉浸－反思”循环的燃料。 奖励可以带来短期的提升，就像咖啡因的刺激可以让你多坚持几个小时一样。但这种影响会逐渐消失，更糟糕的是，这会降低一个人继续从事这个项目的长期动力 个性化学习 我希望学习者能对自己的学习方式、学习内容、学习时间和学习地点有更多的控制权。当学习者拥有更多的选择和控制权时，学习就可以建立在兴趣和热情的基础上，从而变得更加个人化，更有动力，也更有意义。 Peer大多数思考过程都是跟他人联系在一起的；我们互相分享想法，从同伴哪里得到反馈，相互借鉴彼此的灵感。 共创—&gt; 社区应该怎么做？？？ 当人们感到周围的同伴在关心、尊重自己时，他们就更有可能去尝试新事物、承担风险，而风险是创造过程中必不可少的一部分。 好的老师需要扮演的四种角色 催化剂：通过提问，激发学生的想象力、创造性思维 顾问：幕后指导，不是在前台提供最佳答案 连接者： 让学生和其他人连接起来，拓宽眼界和见识 协作者：和学生共创 Play游戏不需要开放的控件或昂贵的玩具，他是好奇心、想象力和实验的结合，创造力蕴含期间。 创造力并非来自欢笑和乐趣，它来自实验、冒险和挑战边界。 游戏 &lt;—&gt; 学习 修补自下而上的过程始于一些看似随机的探索，但并不会就此结束。真正的修补者知道如何将他们最初的探索从底层向上升华，变成一个有目的的活动。 具有成长型思维模式的人认为，智力是可塑的，他们认识到自己可以通过努力工作和投入来继续学习和发展。因此，他们愿意接受挑战，坚持面对挫折，从错误中学习。 创新型社会想帮助年轻人做好准备，让他们在一个创新型社会里生活得更好，方法之一就是确保他们有机会追随自己的兴趣，探索自己的想法，发出自己的声音。在任何时代，我都推崇这些价值观，而现在，它们尤其重要。 给学习者的10条建议 从简单的开始做起 做你自己喜欢的东西 如果你不知道该做什么，那就先瞎折腾吧 不要害怕尝试 找到一个朋友共同协作，并分享想法 为激发你的想法，复制也没关系 把你的想法记在本子上 建造，拆开，再重建 很多事都可能会出错，要坚持住 创建你自己的学习策略 给家长和老师的10条建议 想象：展示例子，激发想法 想象：鼓励捣乱 创造：提供多种材料 创造：拥抱所有类型的制造 游戏：强调过程，而非结果 游戏：延长项目的时间 分享：扮演媒人的角色 分享：作为一个协作者参与进来 反思：带有诚意地问问题 反思：分享你自己的反思 给设计师和开发者的10条建议 为设计师而设计 支持“低地板”和“高天花板” 把墙拓宽 把兴趣和想法结合起来 优先考虑简单性 深刻理解你为之做设计的人 发明你自己想用的东西 组建一个小型跨学科设计团队 设计有趣的学习技术，需要跨学科的专业知识，包括计算机科学、电子工程、设计学、心理学、教育学等 要控制设计，更要利用大众反馈 迭代，迭代，再迭代 终身幼儿园的道路将是漫长而曲折的，需要很多地方、很多人以及很多时间的工作。我们需要开发更好的技术、活动和策略，让孩子更多地参与创造性的学习活动；我们需要创造更多的空间，让孩子能够从事自己的创造性项目，发展他们的创新能力；我们需要想出更好的方法，来记录和展示项目、热情、同伴和游戏的力量。","categories":[],"tags":[{"name":"readingnotes","slug":"readingnotes","permalink":"http://imesong.com/tags/readingnotes/"}],"author":"imesong"},{"title":"1-3Android基础知识-Fragment","slug":"1-3Android基础知识-Fragment","date":"2020-08-27T16:28:22.000Z","updated":"2020-08-27T16:28:22.000Z","comments":true,"path":"2020/08/27/1-3Android基础知识-Fragment/","link":"","permalink":"http://imesong.com/2020/08/27/1-3Android%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86-Fragment/","excerpt":"Fragment 设计初衷Fragment 在 android 3.0 版本增加，先看下官方怎么定义的 Android introduced fragments in Android 3.0 (API level 11), primarily to support more dynamic and flexible UI designs on large screens, such as tablets. Because a tablet’s screen is much larger than that of a handset, there’s more room to combine and interchange UI components. Fragments allow such designs without the need for you to manage complex changes to the view hierarchy. By dividing the layout of an activity into fragments, you become able to modify the activity’s appearance at runtime and preserve those changes in a back stack that’s managed by the activity 目的：解决大屏适配的问题，可以更加灵活的处理 UI 交互，同时支持与 Activity 的比较复杂的交互方式。","text":"Fragment 设计初衷Fragment 在 android 3.0 版本增加，先看下官方怎么定义的 Android introduced fragments in Android 3.0 (API level 11), primarily to support more dynamic and flexible UI designs on large screens, such as tablets. Because a tablet’s screen is much larger than that of a handset, there’s more room to combine and interchange UI components. Fragments allow such designs without the need for you to manage complex changes to the view hierarchy. By dividing the layout of an activity into fragments, you become able to modify the activity’s appearance at runtime and preserve those changes in a back stack that’s managed by the activity 目的：解决大屏适配的问题，可以更加灵活的处理 UI 交互，同时支持与 Activity 的比较复杂的交互方式。 关键生命周期Fragment 组件本身有严格的生命周期回调，同时与所在的 host Activity 有关。 onCreate onCreateView onResume Fragment 作为一个 View，被添加到 ViewGroup 中。 Fragment 添加方式 静态添加 动态加载 静态添加，在 xml 文件中，固定好 Fragment 的 路径和对应的 Fragment 类，加载项目了的时候自动解析。 动态加载，在运行期间决定，具体需要加载哪个 Fragment，同时可以根据不同的状态，对要加载的 Fragment 传入不同的参数。 推荐使用动态加载的方案，更加灵活。 Fragment 管理相关的类 FragmentManager FragmentTransaction FragmentManager 负责管理 Activity 中的Fragment，通过 getSupportFragmentManager 方法获取。 查找当前 Activity 管理的 Fragment，findFragmentById、findFragmentbyTag 等。 管理 Fragment 状态与返回栈的关系，通过 popBackStack()或 addOnBackStackChangedListener() FragmentTransaction 直接操作 Fragment，可以 add、remove、replace 操作，最后通过 commit 提交，提交的时候，可以选择是否将该操作添加到返回栈中 addToBackStack 。BackStack的管理有 Activity 负责，这里可以与 Fragment 的状态关联。看一下 替换 Fragment 的代码示例 123456789101112// Create new fragment and transactionFragment newFragment = new ExampleFragment();FragmentTransaction transaction = getSupportFragmentManager().beginTransaction();// Replace whatever is in the fragment_container view with this fragment,// and add the transaction to the back stacktransaction.replace(R.id.fragment_container, newFragment);transaction.addToBackStack(null);// Commit the transactiontransaction.commit(); Fragment 与 Activity&#x2F;Fragment 数据交互Fragment 本身是 host Activity 的一个成员，Activity 可以通过 FragmentManager，找到对应的 Fragment 引用，有实例化后的引用，可以通过定义接口方法交互。 FragmentA 中定义接口 Activity 中实现接口 12345678910111213141516171819202122232425262728public static class FragmentA extends ListFragment &#123; ... // Container Activity must implement this interface public interface OnArticleSelectedListener &#123; public void onArticleSelected(Uri articleUri); &#125; ...&#125; OnArticleSelectedListener listener; ... @Override public void onAttach(Context context) &#123; super.onAttach(context); try &#123; listener = (OnArticleSelectedListener) context; &#125; catch (ClassCastException e) &#123; throw new ClassCastException(context.toString() + &quot; must implement OnArticleSelectedListener&quot;); &#125; &#125; ... @Override public void onListItemClick(ListView l, View v, int position, long id) &#123; // Append the clicked item&#x27;s row ID with the content provider Uri Uri noteUri = ContentUris.withAppendedId(ArticleColumns.CONTENT_URI, id); // Send the event and Uri to the host activity listener.onArticleSelected(noteUri); &#125; 这样被点击的新闻 Uri 就传递给了 hostActivity。 Activity 与Fragment 生命周期Activity 与 Fragment 生命周期的回调，有严格的对应关系。 先看图 Activity 的 onCreate，对应着 Fragment 的 onCreate、onCreateView、onActivityCreated Activity 创建成功，进入 onResume 状态，同步 Fragment 进入 onResume 状态 Activity 暂停时，Fragment 进入暂停状态 Activity 被销毁是，Fragment 的 view 先回调 onDestroy 方法，再回调 onDetach。 最后，用一张图总结一下","categories":[],"tags":[{"name":"android","slug":"android","permalink":"http://imesong.com/tags/android/"},{"name":"技术体系","slug":"技术体系","permalink":"http://imesong.com/tags/%E6%8A%80%E6%9C%AF%E4%BD%93%E7%B3%BB/"}]},{"title":"1-2Android基础知识-Service、Broadcast、ContentProvider","slug":"1-2Android基础知识-Service","date":"2020-08-26T18:28:01.000Z","updated":"2020-08-26T18:28:01.000Z","comments":true,"path":"2020/08/26/1-2Android基础知识-Service/","link":"","permalink":"http://imesong.com/2020/08/26/1-2Android%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86-Service/","excerpt":"这次把安卓剩余的三个组件Service、BroadcastReceiver、ContentProvider放在一起，也是因为，剩余三个组件的复杂程度、使用频率不及Activity。 不说话，先看图","text":"这次把安卓剩余的三个组件Service、BroadcastReceiver、ContentProvider放在一起，也是因为，剩余三个组件的复杂程度、使用频率不及Activity。 不说话，先看图 Service 定义Service 是可以在后台长期执行而没有用户交互的基础组件。Service 运行在主线程，不可以做耗时的操作。Thread 泛指新建的子线程，不能更新 UI。 Service 生命周期Service 的生命周期，预期方式关联。启动方式有主动启动、绑定启动两种。看下两种启动方式的流程图 Service 流程中的核心的方法如下 onCreate onStartCommand onBind onDestory Service 的优先级Service 按照使用场景，可以区分foreground、background、bind 三种类型，不同类型的优先级不同。优先级越低，在系统资源紧张时，越容易被系统回收掉。 优先级顺序：foreground &gt; bind &gt; background 在 androidmanifest 中，也可以配置 service 的优先级 android:priority &#x3D; “xxxx”,xxxx可以配置为整数，数字越大，优先级越高，最高值为 1000。 JobScheduleServiceJobIntentService 是 Android 8.0 新增的 Service 子类，替代 IntentService。8.0 系统以后，禁止在后台直接创建 Service，但可以创建 JobIntentService。官方的定义如下： 123Helper for processing work that has been enqueued for a job/service.When running on Android O or later, the work will be dispatched as a job via JobScheduler.enqueue.When running on older versions of the platform, it will use Context.startService. 解释：JobIntentService 用于处理被加入到队列的 job&#x2F;service 任务的一个辅助工具。当运行在 Android O 或更高版本时，任务将作为 job 通过 JobScheduler.enqueue() 进行分发；当运行在较老版本的平台上时，任务仍旧会使用 Context.startService() 执行 Android 8.0 及以上版本 JobIntentService 和 JobService 做的事情是相同的，都是等着 JobScheduler 分配任务来执行。 不同点在于，JobService 使用的 handler 使用的是主线程的 Looper，因此需要在 onStartJob() 方法中手动创建 AsyncTask 去执行耗时任务，而 JobIntentService 则帮我们处理这一过程，使用它只需要写需要做的任务逻辑即可，不用担心阻塞主线程的问题。另外，向 JobScheduler 传递任务操作也更简单了，不需要在指定 JobInfo 中的参数，直接 enqueueWork() 方法就可以了。这有点像 Service 和 IntentService 的关系。 BroadcastReceiver广播的定义很好理解，有发送方，有接收方，可以用于在不同的 App ，同一个 App 不同的组件、进程间通信。按发送方，广播可以分为以下四种类型 普通广播 有序广播 本地广播 系统广播 按照注册方式，又可以区分为两种 静态注册 动态注册 发送和接收流程 广播接收者（BroadcastReceiver）通过 Binder 机制，向 AMS 注册成为广播接收者。 广播的发送者，通过 Binder 机制，向 AMS 发送广播。 AMS查找符合条件（IntentFilter、Permission）的 BroadcastReceiver，将广播发送到相应的Receiver 的队列中 消息循环执行拿到此广播，回调 BroadcastReceiver 的 onReceiver 方法 本地广播 &amp; 普通广播相比普通广播，本地广播更加安全、高效。本地广播的发送，只在 App 自身内传播，不必担心隐私泄露的问题，其他 App 也无法发送该广播，故不用担心安全漏洞。本地广播内部通过 Handler 实现，不牵涉跨进程通信，效率更高。 ContentProviderContentProvider 是一个内容提供者，一般用于 App 间数据交互和共享。底层依然使用的 Binder 机制通信。 访问 ContentProvider访问 ContentProvider 的流程大致如下 看下面的示例代码 123456789// Queries the user dictionary and returns resultscursor = getContentResolver().query( UserDictionary.Words.CONTENT_URI, // The content URI of the words table projection, // The columns to return for each row selectionClause, // Selection criteria selectionArgs, // Selection criteria sortOrder); // The sort order for the returned rows query 方法的参数，对比 SQL 语法，可以看下差异 query() argument SELECT Notes Uri FROM table_name Uri maps to the table in the provider named table_name projection col,col,col Projection is an array of columns selection WHERE col &#x3D; value Selection specifies the criteria for selection rows selectionArgs sortOrder ORDER by col,col sortOrder specifies the order in which rows appear in the returned Cursor 可以理解为，ContentProvider 提供了一套更加方便、丰富的访问数据的方法，可以做到读写分离，更加安全可靠。","categories":[],"tags":[{"name":"android","slug":"android","permalink":"http://imesong.com/tags/android/"},{"name":"技术体系","slug":"技术体系","permalink":"http://imesong.com/tags/%E6%8A%80%E6%9C%AF%E4%BD%93%E7%B3%BB/"}]},{"title":"烈日下的一把火","slug":"烈日下的一把火","date":"2020-08-24T18:56:27.000Z","updated":"2020-08-24T18:56:27.000Z","comments":true,"path":"2020/08/24/烈日下的一把火/","link":"","permalink":"http://imesong.com/2020/08/24/%E7%83%88%E6%97%A5%E4%B8%8B%E7%9A%84%E4%B8%80%E6%8A%8A%E7%81%AB/","excerpt":"公司新入职的技术中心负责人，刚入职三天，在管理层的例会上，给大家分享了未来的工作规划。在此分享给大家，一起学习。 目前存在的问题管理流程 研发管理流程缺少精细化的管理和度量，一线团队缺少自我迭代改进的文化机制和土壤。 需求标准规范缺失,需求逻辑质量和目标质量不明确，经常有返工,需求效果不透明没跟踪。 研发约束少，被动式开发，代码准入复查缺失，工程师文化缺乏，开发提测质量差。 保姆式测试，被动接受任务，手工测试占据90%以上工作，可替代性太强，测试人效比比较低(1:4)。 运维规范流程尚不健全,规范化逐步进行，自动化以及平台化尚未起步，手工运维占据90%以上工作。 评注：这五个问题可以归为两类，人的问题和制度的问题 人的问题：1 的后半句，和第 3 项、第 4 项 ，“老白兔”太多了，是人员自我升级不及时，同时人员流动性较差，导致新鲜血液不能及时补充 制度的问题：其他几项，可以理解为，项目管理的各个环节，缺少精细化的管控，各项数据的度量，对项目生命周期的各个阶段无法准去评估。","text":"公司新入职的技术中心负责人，刚入职三天，在管理层的例会上，给大家分享了未来的工作规划。在此分享给大家，一起学习。 目前存在的问题管理流程 研发管理流程缺少精细化的管理和度量，一线团队缺少自我迭代改进的文化机制和土壤。 需求标准规范缺失,需求逻辑质量和目标质量不明确，经常有返工,需求效果不透明没跟踪。 研发约束少，被动式开发，代码准入复查缺失，工程师文化缺乏，开发提测质量差。 保姆式测试，被动接受任务，手工测试占据90%以上工作，可替代性太强，测试人效比比较低(1:4)。 运维规范流程尚不健全,规范化逐步进行，自动化以及平台化尚未起步，手工运维占据90%以上工作。 评注：这五个问题可以归为两类，人的问题和制度的问题 人的问题：1 的后半句，和第 3 项、第 4 项 ，“老白兔”太多了，是人员自我升级不及时，同时人员流动性较差，导致新鲜血液不能及时补充 制度的问题：其他几项，可以理解为，项目管理的各个环节，缺少精细化的管控，各项数据的度量，对项目生命周期的各个阶段无法准去评估。 基础设施建设 缺少研发团队效能度量大盘，研发过程数据基本没有采集，很难给各个团队一个持续改进数据基础。 项目和需求管理信息化尚不健全,从目标到需求开发上线贯穿打透。 测试平台基本没有积累，产出靠堆人。 运维工具化初步建设中，还没有体系化和平台化。 基础架构存在感和产出还很弱，业务认可度不高，移动端一些技术赋能，核心指标优化刚启动。 整体研发架构服务化拆分和服务治理基础设施基本没有（日志进行统一，但应用内日志尚没有标准化和统一）,服务限流熔断降级的基本没有。 基础设施和中台运营能力弱，资源分散运营不同统一，中台是技术平台，更是强运营，要深入一线业务生产帮助业务优化架构和服务化重构。 评注：量化、统一 量化之后，将整个系统链路上的相关人员工具化，只需要提高各自模块的指标和数据即可 统一，提高中心的控制力，同时降低复杂度 人才升级 架构人才要精兵强将，要有大型项目服务化治理的经验，阿里的P7以上，要深入一线生产进行架构治理和重构。 普通开发人才要贯穿工程师文化，要有效率意识和质量意识和工具文化，要对自己代码质量负责(低级和重复的问题必须收到惩罚)，要主动挑战业务需求和结果。 测试人才要部分转型为业务专家，测试必须是要比研发更懂业务，要站在用户的角度去主动提前完善产品需求的不足(测试左移右移)，要主动去跟踪需求上线以后的数据度量效果和反馈改进建议。 测试转型为测试专项领域的技术专家，在公司成立中台测试专项技术研究组，如全链路压测，性能测试，app云测等等。 所有运维都要逐步升级为有开发能力和业务紧迫感的开发者，从自动化脚本开始，逐步升级为合格的云开发，基础设施逐步云化下沉后，运维开发将承担越来越重要的角色。 评注：一切问题，归根结底都是人的问题万里江山万里尘，一朝天子一朝臣，又是一场血雨腥风，关键是，当事人有没有能力主动选择。 全局规划，业务 sense，闭环思维改进方案：降本增效提质，架构升级敏捷文化，工程师文化落地 scrum+xp+看板实践，一线研发团队自改进自优化,持续迭代，持续进步，逐步量变积累到质变。 研发效能度量体系驱动持续改进。 研发质量提升3倍以上，测试开发比达到1：7，测试开发时间比达到1：4以上,迭代吞吐量上升30%，迭代计划完成率95%以上；平局需求交付时长缩短30%以上。 提升研发中台平台化和运营能力 整合测试开发，运维开发以及基础架构承载研发中台使命，集中开发资源，从开发测试运维全局角度做整体规划和优先级排序。 以应用为中心做全局设计，从应用创建规范，app应用可视化编排(app工厂),应用代码提交，应用交付流水线，应用启动运行统一监控告警，应用日志统一采集分发存储，应用下架资源回收和依赖整理告警等。 中台不仅是工具平台，更是流程和文化，成立专门的运营组负责推进整体落地，并且持续迭代改进业务需求。 移动端增强技术赋能，逐步提升移动端app标准的核心指标,如app启动速度，首页速度,crash率,耗电，包体积，马甲包交付速度，热升级等各个业内标准实践。 各角色的人才升级架构升级，精细化管理降低it成本 业务应用逐步云化架构，应用上云是为了让应用符合无状态，自动动态扩容收容,有效降低it运维成本。 以应用为中心梳理每个应用使用多少cpu，多少内存，多少存储等，对it成本有更精细化的分析和计算。 加强和阿里云谈判，现阶段是85折，整体千万级应用成本理论上可以拿到5折以下，总的来说通过商务手段和技术升级，能将it成本降低30%。","categories":[],"tags":[]},{"title":"1-1-Android基础知识-Activity","slug":"1-1Android基础知识-Activity","date":"2020-08-20T11:15:14.000Z","updated":"2020-08-20T11:15:14.000Z","comments":true,"path":"2020/08/20/1-1Android基础知识-Activity/","link":"","permalink":"http://imesong.com/2020/08/20/1-1Android%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86-Activity/","excerpt":"为什么会有Activity？安卓应用开发的时候，首先接触到的就是四大组件之一 Activity，可曾深入思考一下，为什么会有 Activity，安卓系统设计这个组件的目的是什么呢？ Activity 是系统与用户交互的载体，由于用户的行为不可预期性，导致 Activity 的状态比较复杂，管理起来也比较麻烦，衍生出一套解决方案 安卓系统中的很多应用，没有可见的界面，可以没有 Activity。Activity 很重要，但并非不可缺少。","text":"为什么会有Activity？安卓应用开发的时候，首先接触到的就是四大组件之一 Activity，可曾深入思考一下，为什么会有 Activity，安卓系统设计这个组件的目的是什么呢？ Activity 是系统与用户交互的载体，由于用户的行为不可预期性，导致 Activity 的状态比较复杂，管理起来也比较麻烦，衍生出一套解决方案 安卓系统中的很多应用，没有可见的界面，可以没有 Activity。Activity 很重要，但并非不可缺少。 Activity 的生命周期关键方法 onCreate onStart onResume onPause onStop onDestory 生命周期回调中的方法，不可以做耗时的操作，尤其是onResume和onPause,这两个方法在 Activity 的状态管理中，会频繁的调用。 典型场景下的生命周期回调A —&gt; B —&gt; A标准模式下，A 启动 B， B 再返回 A 页面 123456789101112D/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A2 OnCreateD/LifeCycle: A2 onStartD/LifeCycle: A2 onResumeD/LifeCycle: A1 onStopD/LifeCycle: A2 onPauseD/LifeCycle: A1 onStartD/LifeCycle: A1 onResumeD/LifeCycle: A2 onDestroy A 页面启动后，旋转屏幕默认配置下，旋转屏幕 12345678910D/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A1 onStopD/LifeCycle: A1 onDestroyD/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onRestoreInstanceStateD/LifeCycle: A1 onResume A 页面中还有一些关键方法，同时也添加了日志，但是并没有输出 onConfigChange onSaveInstanceState 但这两个方法并没有被调用 1234567891011121314151617181920@Overrideprotected void onRestoreInstanceState(@NonNull Bundle savedInstanceState) &#123; super.onRestoreInstanceState(savedInstanceState); Log.d(&quot;LifeCycle&quot;,&quot;A1 onRestoreInstanceState&quot;);&#125;@Overridepublic void onSaveInstanceState(@NonNull Bundle outState, @NonNull PersistableBundle outPersistentState) &#123; super.onSaveInstanceState(outState, outPersistentState); Log.d(&quot;LifeCycle&quot;,&quot;A1 onSaveInstanceState&quot;);&#125;@Overridepublic void onConfigurationChanged(@NonNull Configuration newConfig) &#123; super.onConfigurationChanged(newConfig); Log.d(&quot;LifeCycle&quot;,&quot;A1 onConfigureChange&quot;);&#125; 关于生命周期的两个扩展问题 什么情况下，A 页面会调用 onPause ，但不会调用 onStop 方法 onCreate 方法中的 Bundle 和 onRestoreInstanceState 中 Bundle 一样吗？能重复获取吗？ Activity 启动模式和任务栈管理 standard singleTask singleTop singleInstance 如果对这个不了解，可以先阅读官方文档 Tasks and back stack,官方的讲解非常的清晰易懂，同时配有插图辅助理解。 以下内容摘自官方文档，配合简要说明。 standard Default. The system creates a new instance of the activity in the task from which it was started and routes the intent to it. The activity can be instantiated multiple times, each instance can belong to different tasks, and one task can have multiple instances. 关键点：默认会初始化多次，每个任务栈可以有多个实例 singleTop If an instance of the activity already exists at the top of the current task, the system routes the intent to that instance through a call to its onNewIntent() method, rather than creating a new instance of the activity. The activity can be instantiated multiple times, each instance can belong to different tasks, and one task can have multiple instances (but only if the activity at the top of the back stack is not an existing instance of the activity).For example, suppose a task’s back stack consists of root activity A with activities B, C, and D on top (the stack is A-B-C-D; D is on top). An intent arrives for an activity of type D. If D has the default “standard” launch mode, a new instance of the class is launched and the stack becomes A-B-C-D-D. However, if D’s launch mode is “singleTop”, the existing instance of D receives the intent through onNewIntent(), because it’s at the top of the stack—the stack remains A-B-C-D. However, if an intent arrives for an activity of type B, then a new instance of B is added to the stack, even if its launch mode is “singleTop”. 关键点：栈顶的如果是即将要启动的 Activity，会直接启动当前 Activity，同时调用 onNewIntent（） 方法，而不是 onCreate 方法 singleTask The system creates a new task and instantiates the activity at the root of the new task. However, if an instance of the activity already exists in a separate task, the system routes the intent to the existing instance through a call to its onNewIntent() method, rather than creating a new instance. Only one instance of the activity can exist at a time. 关键点：首次创建该 Activity时，新建一个 task；非首次，共用之前的，同时回调 onNewIntent() 方法 同时 singleTask 下，Activity 的生命周期回调也会有所不同 A—&gt;B—&gt;A 日志如下 12345678910111213141516D/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A2 OnCreateD/LifeCycle: A2 onStartD/LifeCycle: A2 onResumeD/LifeCycle: A1 onStopD/LifeCycle: A2 onPauseD/LifeCycle: A1 onStartD/LifeCycle: A1 onNewIntentD/LifeCycle: A1 onResumeD/LifeCycle: A2 onDestroy 再次启动 A 的时候，B 直接回调了 onDestory 方法，返回栈被清空。 singleInstance Same as “singleTask”, except that the system doesn’t launch any other activities into the task holding the instance. The activity is always the single and only member of its task; any activities started by this one open in a separate task. 关键点：独占任务栈 A–&gt;B–&gt;A –&gt;返回–&gt;返回 生命周期的日志如下 123456789101112131415161718192021222324D/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A2 OnCreateD/LifeCycle: A2 onStartD/LifeCycle: A2 onResumeD/LifeCycle: A1 onStopD/LifeCycle: A2 onPauseD/LifeCycle: A1 onStartD/LifeCycle: A1 onNewIntentD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A2 onStartD/LifeCycle: A2 onResumeD/LifeCycle: A1 onStopD/LifeCycle: A1 onDestroyD/LifeCycle: A2 onPauseD/LifeCycle: A2 onDestroy B 再次启动 A 后，之前的任务栈被共用，A 在一个新的任务栈中。 Intent FLAG FLAG_ACTIVITY_NEW_TASK FLAG_ACTIVITY_SINGLE_TOP FLAG_ACTIVITY_CLEAR_TOP 如果同时在 manifest 和 Intent FLAG 定义，最终会以 Intent FLAG 中定义的为准。 FLAG_ACTIVITY_NEW_TASK This produces the same behavior as the “singleTask” launchMode value 关键点：和 singleTask 效果一样。 FLAG_ACTIVITY_SINGLE_TOP This produces the same behavior as the “singleTop” launchMode value 关键点：和 singleTop 效果一样。 FLAG_ACTIVITY_CLEAR_TOP If the activity being started is already running in the current task, then instead of launching a new instance of that activity, all of the other activities on top of it are destroyed and this intent is delivered to the resumed instance of the activity (now on top), through onNewIntent()). FLAG_ACTIVITY_CLEAR_TOP is most often used in conjunction with FLAG_ACTIVITY_NEW_TASK. When used together, these flags are a way of locating an existing activity in another task and putting it in a position where it can respond to the intent. 关键点：如果已经在当前任务栈，会清空上面的页面，把自己提升到栈顶，同时回调 onNewIntent(),一般和FLAG_ACTIVITY_NEW_TASK共用，与singleTask 有点类似。 TaskAffinitytaskAffinity 是为了更好的管理 Activity 和任务栈的关系 。默认情况下，同一个 App 的所有的 Activity 都在一个 task 中（标准模式）。但如果有多个 task，当启动一个 Activity 时，优先选择哪一个 task 呢？可以通过 taskAffinity 来定制。并且不同的 App，也可以共享同一个 Affinity。一个 App 中，也可以有多个不同的 taskAffinity。 再复杂一些的任务栈管理方案，在项目中也很少会用到了。 Activity 的数据恢复和状态恢复什么情况下需要数据和状态恢复呢？ 异常退出，因内存等原因，被系统回收，再次回到前台时，能够恢复离开时的状态 异常中断，比如看新闻时，被一个电话打断，接完电话再回来时，希望继续刚才阅读的位置继续。 和状态恢复相关的关键方法有两个 12345678910111213@Overridepublic void onSaveInstanceState(@NonNull Bundle outState, @NonNull PersistableBundle outPersistentState) &#123; super.onSaveInstanceState(outState, outPersistentState); Log.d(&quot;LifeCycle&quot;,&quot;A2 onSaveInstanceState&quot;);&#125;@Overrideprotected void onRestoreInstanceState(@NonNull Bundle savedInstanceState) &#123; super.onRestoreInstanceState(savedInstanceState); Log.d(&quot;LifeCycle&quot;,&quot;A2 onRestoreInstanceState&quot;);&#125; 实际验证下来，这两个方法的调用都不正常，在不同版本、不同手机上会有差异，可靠性无法保障。 横竖屏切换时，Activity 生命周期的变化在这里，典型场景下 Activity 生命周期变化 中，已经说明了默认情况下(不设置 Activity 的 android:configChanges 属性)，旋转屏幕Activity 生命周期的变化。还有另外一个场景，做一些系统配置后，生命周期的回调会发生改变。 再看一下 设置 android:configChanges&#x3D; “orientation” 属性后，生命周期的变化 A 启动–&gt;旋转–&gt;旋转–&gt;退出 1234567891011121314151617181920212223D/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A1 onStopD/LifeCycle: A1 onDestroyD/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onRestoreInstanceStateD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A1 onStopD/LifeCycle: A1 onDestroyD/LifeCycle: A1 oncreateD/LifeCycle: A1 onStartD/LifeCycle: A1 onRestoreInstanceStateD/LifeCycle: A1 onResumeD/LifeCycle: A1 onPauseD/LifeCycle: A1 onStopD/LifeCycle: A1 onDestroy 属性配置为 android:configChanges&#x3D; “orientation|screenSize” 后，生命周期的变化 A 启动–&gt;旋转–&gt;旋转–&gt;退出 1234567891011D/LifeCycle: A2 OnCreateD/LifeCycle: A2 onStartD/LifeCycle: A2 onResumeD/LifeCycle: A2 onConfigureChangeD/LifeCycle: A2 onConfigureChangeD/LifeCycle: A2 onPauseD/LifeCycle: A2 onDestroy 所以，在使用的时候，需要把 screenSize 和 orientation 配合使用。 Activity 的扩展问题 - TODOActivity 这个主题下，遗留的 7 个扩展问题，这些问题的解答，会在Android 高级 完成后再来解决，每个扩展问题，都可以单独一个章节阐述，也是我们在项目开发中，知道深入思考的问题。 影响 Activity 启动速度的因素有哪些？如何优化 Activity 的启动速度？ 微信、支付宝支付界面的启动方案如何设计，有哪些借鉴意义？ Activity 的数据恢复的其他方案有哪些（至少 3 种），这些方案各有哪些优劣？ LifeCycle 如何观察 Activity 的声明周期？使用了何种设计模式，阐述下核心的设计流程 四种启动模式，各自典型的应用场景有哪些，如果自己设计管理 Activity 的任务栈，有哪些思路可以参考？ 从 Activity 关键生命周期方法中，如何统计一个 Activity 的用户使用时长，在做的时候，应该注意哪些问题？ Activity 、Window和 View 之间的关系","categories":[],"tags":[{"name":"android","slug":"android","permalink":"http://imesong.com/tags/android/"},{"name":"技术体系","slug":"技术体系","permalink":"http://imesong.com/tags/%E6%8A%80%E6%9C%AF%E4%BD%93%E7%B3%BB/"}]},{"title":"1-0-Android基础知识-大纲介绍","slug":"1-0Android基础知识","date":"2020-08-19T19:04:35.000Z","updated":"2020-08-19T19:04:35.000Z","comments":true,"path":"2020/08/19/1-0Android基础知识/","link":"","permalink":"http://imesong.com/2020/08/19/1-0Android%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86/","excerpt":"Android 基础知识泛指工作经验在 3-5 年左右，应该熟练掌握的内容，涵盖了 Android 官方的开发文档中 core topic 的所有内容,掌握这些之后，能够独立开发一款高质量的应用。 基础知识大纲 Activity Service Broadcast ContentProvider Context Intent Fragment 官方UI组件的理解和应用 Android 消息机制 Android 事件处理机制 自定义 View 第三方库基础库的理解和应用 数据存储 App 主题、资源 多线程 多进程","text":"Android 基础知识泛指工作经验在 3-5 年左右，应该熟练掌握的内容，涵盖了 Android 官方的开发文档中 core topic 的所有内容,掌握这些之后，能够独立开发一款高质量的应用。 基础知识大纲 Activity Service Broadcast ContentProvider Context Intent Fragment 官方UI组件的理解和应用 Android 消息机制 Android 事件处理机制 自定义 View 第三方库基础库的理解和应用 数据存储 App 主题、资源 多线程 多进程 大纲解析基础知识大纲的组织，主要参考 Android 官方开发文档主题的呈现顺序，同时结合个人在多年的项目开发中的实践情况，从最基础的四大组件，到自定义 View，第三开源库的分析学习，逐层递进。重点内容放在官方的四大组件的理解和应用上，同时会记录四大组件在项目使用中，容易忽视的的兼容性问题。 先看下大纲的思维导图 后面有数字的子项，是因为篇幅原因，相关的子项折叠起来了，在具体的内容分析时，都会涉及。","categories":[],"tags":[{"name":"android","slug":"android","permalink":"http://imesong.com/tags/android/"},{"name":"技术体系","slug":"技术体系","permalink":"http://imesong.com/tags/%E6%8A%80%E6%9C%AF%E4%BD%93%E7%B3%BB/"}]},{"title":"00-Android知识体系-启程","slug":"00-Android知识体系","date":"2020-08-19T15:54:45.000Z","updated":"2020-08-19T15:54:45.000Z","comments":true,"path":"2020/08/19/00-Android知识体系/","link":"","permalink":"http://imesong.com/2020/08/19/00-Android%E7%9F%A5%E8%AF%86%E4%BD%93%E7%B3%BB/","excerpt":"关于知识体系的定位 首先是给自己的看的，看过往，明得失。通过对过往的复盘，进一步帮助自己明晰当下的定位，能够对自我有一个更加全面认知（不仅仅是技术）。 尽量能够让大家都能看懂，但不做承诺。该知识体系会有很明显的个人烙印，在整个系统工程完成后，会再整理一份通用版（不承诺一定会有）。 知识体系大纲 Android 基础知识 Android 高级知识 Java 基础知识 Java 高级知识 架构设计 跨平台 工程效率 安全 数据结构与算法 项目管理 团队管理 面试题精选","text":"关于知识体系的定位 首先是给自己的看的，看过往，明得失。通过对过往的复盘，进一步帮助自己明晰当下的定位，能够对自我有一个更加全面认知（不仅仅是技术）。 尽量能够让大家都能看懂，但不做承诺。该知识体系会有很明显的个人烙印，在整个系统工程完成后，会再整理一份通用版（不承诺一定会有）。 知识体系大纲 Android 基础知识 Android 高级知识 Java 基础知识 Java 高级知识 架构设计 跨平台 工程效率 安全 数据结构与算法 项目管理 团队管理 面试题精选 Android 历史版本Android 系统 从 2008 年发布以来，到今天（2020 年 8 月）已经更新 18 个大版本，相关的技术体系和专业技能的要求，已经发生了很大变化 名称 版本号 发行日期 API 等级 Android1.0 1.0 2008 年 9 月 23 日 1 Android1.1 1.1 2009 年 2 月 9 日 2 Android Cupcake 1.5 2009 年 4 月 27 日 3 Android Donut 1.6 2009 年 9 月 15 日 4 Android Eclair 2.0-2.1 2009 年 10 月 26 日 5-7 Android Froyo 2.2-2.2.3 2010 年 5 月 20 日 8 Android Gingerbread 2.3-2.3.7 2010 年 12 月 6 日 9-10 Android Honeycomb 3.0-3.2.6 2011年 2 月 22 日 11-13 Android Ice Cream Sandwich 4.0-4.0.4 2011 年 10 月 18 日 14-15 Android Jelly Bean 4.1-4.3.1 2012 年 7 月 9 日 16-18 Android KitKat 4.4-4.4.4 2013 年 10 月 31 日 19-20 Android Lollipop 5.0-5.1.1 2014 年 11 月 12 日 21-22 Android Marshmallow 6.0-6.0.1 2015 年 10 月 5 日 23 Android Nougat 7.0-7.1.2 2016 年 8 月 22 日 24-25 Android Oreo 8.0-8.1 2017 年 8 月 21 日 26-27 Android Pie 9 2018 年 8 月 6 日 28 Android 10 10 2019 年 9 月 3 日 29 Android 11 11 2020 年 2 月 19 日 30 以上数据来自 wiki 自己从事 Android 开发工作已经 7 年的时间，计划系统的梳理移动开发领域的知识体系，形成自己的职业发展路线图，在自我总结的同时，也能够给其他人一些参考。 先放一份正在整理的一张知识框架的思维导图 Android 知识体系概览 这是一份未完成的框架，当前包含 12 个一级主题，几百个子主题，计划用半年左右的时间完成（截止目标暂定 2021 年 3月10 日）。","categories":[],"tags":[{"name":"android","slug":"android","permalink":"http://imesong.com/tags/android/"},{"name":"技术体系","slug":"技术体系","permalink":"http://imesong.com/tags/%E6%8A%80%E6%9C%AF%E4%BD%93%E7%B3%BB/"}]},{"title":"逻辑写作笔记","slug":"逻辑写作笔记","date":"2020-07-25T14:02:40.000Z","updated":"2020-07-25T14:02:40.000Z","comments":true,"path":"2020/07/25/逻辑写作笔记/","link":"","permalink":"http://imesong.com/2020/07/25/%E9%80%BB%E8%BE%91%E5%86%99%E4%BD%9C%E7%AC%94%E8%AE%B0/","excerpt":"本文内容主要来自 三节课 逻辑写作课程的学习笔记，选取部分章节。 逻辑 怎么理解？ 首先有观点，明确且唯一，用事实和论点去支持佐证，论点和事实按照一定的顺序展开。结构分明，条理清晰，重点突出。 写作是职场中的一项重要技能，在平常的日报、周报及月报，还有阶段性的工作汇报与总结，都需要用到写作的技能。在对外提交正式的书面邮件时，如何准确、简洁、严谨的传递出信息，体现了个人的综合能力。 写作的时候，要能够在阅读者的角度考虑 内容是否通俗易懂 重点是否突出，简洁明了 是否有太多行业术语 逻辑写作主要从 观点、案例、总结 三个方面阐述，如何进行有逻辑的创作","text":"本文内容主要来自 三节课 逻辑写作课程的学习笔记，选取部分章节。 逻辑 怎么理解？ 首先有观点，明确且唯一，用事实和论点去支持佐证，论点和事实按照一定的顺序展开。结构分明，条理清晰，重点突出。 写作是职场中的一项重要技能，在平常的日报、周报及月报，还有阶段性的工作汇报与总结，都需要用到写作的技能。在对外提交正式的书面邮件时，如何准确、简洁、严谨的传递出信息，体现了个人的综合能力。 写作的时候，要能够在阅读者的角度考虑 内容是否通俗易懂 重点是否突出，简洁明了 是否有太多行业术语 逻辑写作主要从 观点、案例、总结 三个方面阐述，如何进行有逻辑的创作 观点对一项事情的看法或判断，观点要鲜明，有明确清晰，重点突出。观点有以下几个特性 观点是有限的 观点可以包含事实 观点可以包含多个论点 观点的有限性一篇文章的观点，最好不要超过3个。7个观点是上线，参考《奇妙的数字7+2》。 观点可以包含事实通过陈述事实的方式，表达观点。虽然事实是客观存在的，但通过对事实的选择，体现我们的观点。如：小明同学身高150，体重200斤。这是一个描述小明身高体重的事实描述，但接收到这个信息的人，都会觉得，小明是一个小胖子。通过描述事实的方式，传递一个有价值导向的观点。 观点可以包含多个论点用论点去论证观点，论点是观点的子集，是观点的一部分。 观点：小明同学是一个优秀的伙伴。 论点1：小明的技术能力很突出，大家有解决不了的问题，交给小明，他总是能够解决。论点2：小明对公司的责任心很强，在放假期间，小明主动解决了客户反馈的问题，提高了我们公司的品牌和形象。论点3：小明的学习能力强，小明刚进公司的时候，对数据分析的业务不了解，通过两个月的学习，已经胜任公司各个项目的分析要求，能够为项目的精细化运营提供有效的分析结论。 上面的示例，从技术能力、责任心、学习能力三个论点，支撑小明是一个优秀的伙伴的观点。 论点可以有子论点，论点的提炼原则可以使用MECE法则 相互独立 完全穷尽论点可以按照时间、程度、演绎的方式组织。 案例案例可以有三种形式呈现 故事 数据 论述性文字 故事增加人的感性认知，可以打动人，情绪上感染人。数据可以增加理性，逻辑更加严谨论述性文字描述推理、思考的过程。 总结 回顾主题，让读者明白，文章讲述的是什么，你在表达什么 升华主题，让读者意犹未尽。","categories":[],"tags":[{"name":"写作","slug":"写作","permalink":"http://imesong.com/tags/%E5%86%99%E4%BD%9C/"}]},{"title":"10x-engineer","slug":"10x-engineer","date":"2020-04-01T20:29:17.000Z","updated":"2020-04-01T20:29:17.000Z","comments":true,"path":"2020/04/01/10x-engineer/","link":"","permalink":"http://imesong.com/2020/04/01/10x-engineer/","excerpt":"10x engineers 技术雷达在过去的几个月中，10倍工程师一词受到了密切的关注。一个广泛传播的推文讨论在实质上建议公司应原谅反社会和破坏性的行为，以留住被认为个人产出巨大的工程师。幸运的是，许多人在社交媒体上都嘲笑了这个概念，但是“明星开发者”的刻板印象仍然普遍存在。根据我们的经验，伟大的工程师不是因为个人产出而是因为能在优秀的团队中合作而诞生。打造一支混合不同经验和背景，但成员才华横溢的团队，并为团队合作、学习和持续改进提供良好的助力，这会是更行之有效的方式。这些10倍团队行动起来更快，弹性也更强——而无需屈从错误的行为。 概述本质复杂度Essential Complexity 偶然复杂度Accident Complexity 选择正确的做事方法，减少偶然复杂度带来的工作量； 原则 以终为始 任务分解 沟通反馈 自动化","text":"10x engineers 技术雷达在过去的几个月中，10倍工程师一词受到了密切的关注。一个广泛传播的推文讨论在实质上建议公司应原谅反社会和破坏性的行为，以留住被认为个人产出巨大的工程师。幸运的是，许多人在社交媒体上都嘲笑了这个概念，但是“明星开发者”的刻板印象仍然普遍存在。根据我们的经验，伟大的工程师不是因为个人产出而是因为能在优秀的团队中合作而诞生。打造一支混合不同经验和背景，但成员才华横溢的团队，并为团队合作、学习和持续改进提供良好的助力，这会是更行之有效的方式。这些10倍团队行动起来更快，弹性也更强——而无需屈从错误的行为。 概述本质复杂度Essential Complexity 偶然复杂度Accident Complexity 选择正确的做事方法，减少偶然复杂度带来的工作量； 原则 以终为始 任务分解 沟通反馈 自动化 思考框架 Where are we ? Where are we going ? How can we get there ? 以终为始如何让努力不白费？ 任何事情都要经过两次创造：一次是在脑中，是智力上的创造，然后才是付诸实践，也就是实际的构建 对做软件的人来说，我们应该把”终”定位成做一个对用户有价值的软件，能够为别人带来价值，自己的价值才能体现出来。 tips:设计一个以终为始的项目或示例 DoD 的价值Definition of Done User Story使用情景演绎的方式，完善需求 主题 概述 详述 验收标准 验收标准中，非常重要的是异常流程的描述，类似于测试用例中的异常逻辑验证。 持续集成研发需要交付的，不是一堆代码文件，而是可以运行的软件或系统。 虽然我们在同一个时代写代码做开发，但在技术实践层面，不同的团队却仿佛生活在不同的年代 精益创业IT行业中大多数人的专业程度是不够的。我们必须要有自己的独立思考，多问几个为什么，尽可能减少掉到坑里之后再求救的次数。 精益创业：面向不确定性创造新事物。精益创业提供给我们的是一个做产品的思考框架，我们能够接触到的大多数产品都可以放在这个框架内思考。 build–measure–learn 循环 默认所有需求都不做，直到弄清楚为什么要做这件事。 坑里坑外角色的差异:不同角色工作上的真正差异是上下文的不同。同样是写代码，有的人看到的是树木，有的人看到的是森林，能够从全局思考。 手里有一把锤子，满世界都是钉子。 花费很大力气去解决一个可能并不是问题的问题，常常是很多程序员的盲区。 演绎最后一公里：如果想要达到目标，最后我们要做的是什么 从结果入手，看看最终上线需要考虑哪些因素 演绎出一个可以一步步执行的方案，用前面考虑到的因素作为衡量标准 根据演绎出来的方案，总结要做的任务 以终为始，但通往结果的路径更加重要。 量化洞见（Insight）:依赖于一个人在一个领域长期的沉淀和积累，其实是某种意义上的大数据。 Planning&amp;Prepare设计自己的迭代0清单 任务分解银河系中，有多少与我们相近的文明。德雷克公式：N&#x3D; R* x Fp x Ne x f1 x fi x l 埃隆马斯克的火星探测计划：把一个人从地球送到火星，成本降低100万倍。 测试对每个程序员来说，只有在开发阶段把代码和测试都写好了，才有资格说，自己交付的是高质量的代码。 冰淇淋蛋卷测试模型：费时费力的测试模型 手动回归测试 自动化端到端测试 集成测试 单元测试 测试金字塔 UI 服务 单元 越是底层的测试，牵扯的相关内容越少，而高层测试则涉及面更广。 多写单元测试 TDD 测试驱动开发测试驱动代码：一个static方法示例，如何测试一个static方法，OOP的思想下如何更好的完成。 Test Driven Development Test Driven Design 编写可测试的代码 大师级程序员秘籍 TDD从而来？ 《解析极限编程》 《测试驱动开发》 将任务分解，越小越好。 任务分解练习需求：用户通过输入用户名、密码登陆。 优秀的测试代码一段旅程 A-TRIP Automagic Thorough Repeatable Independent Professional 砍需求用户故事的评价原则： INVEST Independent Negotiable 可协商的 Valuable Estimatable Small Testable 想要管理好需求，先把需求拆小 需求的估算，怎么做才会比较合理，误差最小？ 推荐书籍 《User Stories Applied》 用户故事与敏捷方法 《Aglie Estimating and Planning》敏捷软件开发实践 需求管理需求优先级管理，重要程度、紧急程度 最小代价MVP：Minimum Viable Product 最小可行产品 沟通反馈人生不如意，十之八九。 沟通反馈就是改善编码、解码以及算法的方式。 编写可维护的代码 任何人都可以写出计算机能够理解的代码，只有优秀的程序员才能写出人能够理解的代码 ——Martin Fowler 用业务语言编程 领域驱动设计：Domain Driven Design 推荐阅读《代码整洁之道》–Robert Martin 22 轻量级沟通：为什么总是在开会开会是为了解决问题，但真实情况是开了会没有解决多少问题，却产生了会议过多的问题 凡是效果特别号的会议，都是用来做信息同步的；效果不好的会议，基本都是用来讨论的。 改善会议： 减少参会人数 当面沟通 站立会议 可视化：一种更为直接的沟通方式技术雷达：结构化学习新知识的方式 构建自己的知识雷达 快速反馈：如何做好持续集成 持续集成监视器，实时显示持续集成的状态 遇到问题立即响应 复盘不要被同样的招数击败两次 复盘的好处：客体化，用别人的视角看问题 复盘：过程还原，进行研讨与分析，找到自我改进方法的一个方式。这种方式拥有客体化的视角，能够更客观的看待曾经发生的一切。 定期复盘，找准问题的根本原因，不断改善。 倾听用户的声音谁离用户近，谁就有发言权，无论你是什么角色 多走进用户 产品经理是用户需求的传声筒 Fail Fast如果有问题，那就尽早的将问题暴露出来。 越早的暴露问题，解决问题的成本就越低。 结构化学习：会写文档将零散的知识结构化有很多种方式，输出是非常关键的一环。 如何写好文档：无他，唯手熟尔。 推荐阅读 《乔布斯的演讲魔力》 懒惰的天性做有价值的事是最重要的，这里的有价值，不仅仅是做了什么，通过不做节省时间和成本也是有价值的。 从日常工作中的自动化开始，打造自己的自动化利器 给别人打造自动化工具中需要具备的能力：软件设计 在软件开发中，其他的东西都是易变的，唯有设计的可变性的可变性是自己可以控制的。 优秀程序员的三大美德：懒惰、急躁和傲慢。 项目自动化将工作过程自动化。 零散的运维知识将零散的运维知识系统化，怎么系统化？ 持续交付 ≠ 持续集成如何构建持续交付系统 将部署纳入开发的考量 测试验收BBD: Behavior Driven DevelopmentBBD 测试框架 Cucumber 关键一点：将验收测试自动化 逐步腐化的代码对程序员最好的惩罚是让他维护自己三个月前写的代码 软件设计原则: SOLID Single responsibility principle Open-closed principle Liskov subsitution principle Interface segregation principle Dependency inversioni principle 将函数写短 MVC 封层设计分层的价值：构建一个良好的抽象 如何使用5万块做一个淘宝推荐书籍《淘宝技术这十年》 不同量级的系统，根本不是一个系统 用简单的技术解决问题，直到问题变复杂 做好DDD 再谈微服务DDD: Domain Driven Design 领域驱动设计 推荐书籍 企业应用架构模式 领域驱动设计 实现领域驱动设计 领域驱动设计精粹 如何维护系统改造遗留系统，一个关键点就是，不要回到老路上。 书籍推荐 修改代码的艺术 如何保持竞争力一专多能，成为T字型人才 在学习区工作和成长。","categories":[],"tags":[{"name":"readingnotes","slug":"readingnotes","permalink":"http://imesong.com/tags/readingnotes/"}]},{"title":"Tmux 使用小结","slug":"Tmux-tips","date":"2020-03-30T22:50:00.000Z","updated":"2020-03-30T22:50:00.000Z","comments":true,"path":"2020/03/30/Tmux-tips/","link":"","permalink":"http://imesong.com/2020/03/30/Tmux-tips/","excerpt":"Install在 mac 系统上，通过brew 安装 tmux brew search tmux brew info tmux brew install tmux Config使用github上寻找到的通用的配置,按照教程安装完成。 基本概念理解 Session window pane 基本概念介绍","text":"Install在 mac 系统上，通过brew 安装 tmux brew search tmux brew info tmux brew install tmux Config使用github上寻找到的通用的配置,按照教程安装完成。 基本概念理解 Session window pane 基本概念介绍 oh-my-tmux 配置理解全局属性设置，prefix 绑定键，默认是Ctrl+b ，使用不方便，oh-my-tmux 中补充 Ctrl+a 为prefix键。 Session 操作 操作 命令 释义 新建session tmux new -s demo 创建名字为 demo 的session 查看当前session状态 tmux list-session &#x2F;tmux ls 列出当前所有的session，只能查看，不能切换 切换session prefix s 列出所有session，可以使用 j&#x2F;k 键切换 rename session prefix $ kill-session tmux kill-session -t demo close demo session kill-server tmux kill-server close server ,everything gone attach-session tmux attach-session -t sessionName Window 操作一个window，一般会分割为多个pane，当然，默认是1个pane。类似iTerm的Tab 操作 命令 释义 新建window prefix c 切换窗口 prefix 窗口号 如切换到第2个窗口：prefix 2 关闭当前窗口 prefix &amp; 查看所有窗口 tmux list-window 显示所有窗口，并标注active的window Pane 操作 操作 命令 释义 水平分割window或pane prefix - 将一个window或者pane 水平分割为2等份，类似 sp 垂直分割window或pane prefix _ 类似 vs 暂时把pane放到最大 prefix z pane填充满整个window,再次执行该操作，状态恢复 查看所有pane 的编号 prefix q","categories":[],"tags":[{"name":"tools","slug":"tools","permalink":"http://imesong.com/tags/tools/"}]},{"title":"2019-summary","slug":"2019summary","date":"2020-01-06T22:40:15.000Z","updated":"2020-01-06T22:40:15.000Z","comments":true,"path":"2020/01/06/2019summary/","link":"","permalink":"http://imesong.com/2020/01/06/2019summary/","excerpt":"","text":"古语有 “三十而立”，渴望经历三十个春秋后，能够“立身、立家、立业”。躬身自问，而立之年，得失参半。 生活中关键的选择人生关键节点不多，每一次抉择，都决定了未来数年，甚至数十年的生活、工作。2019年，有幸完成了几次关键选择。 “居者有其屋”，给家人一个稳定的居住环境。按照自己的设想，从裸露的钢筋、混凝土开始，一步步装饰成梦想中的家。 “身份”转正，修成正果。在“魔都”漂浮7年，通过人才引进，顺利拿到了上海的户口，同时解决了Dora上学的后顾之忧。 职业身份转换。历经7年，从一个学生，蜕变成一名职场人。2019，是终点亦是起点，下一个7年，作为一个名正言顺的”管理者”，策马向前，开启新的征程。 天使与魔鬼，等价交换？不曾想过，在接受生活的馈赠同时，我也要给其等价的东西交换。 业绩不突出，腰椎间盘开始突出。 夜夜笙歌，时不时有天使在耳边歌唱。2018年中开始，经常有神经性耳鸣。 体重暴增3kg，这么多年，体重从未超过62kg。今年开始，首次接近65kg","categories":[],"tags":[{"name":"summary","slug":"summary","permalink":"http://imesong.com/tags/summary/"}]},{"title":"费曼技巧","slug":"费曼技巧","date":"2019-12-06T20:29:13.000Z","updated":"2019-12-06T20:29:13.000Z","comments":true,"path":"2019/12/06/费曼技巧/","link":"","permalink":"http://imesong.com/2019/12/06/%E8%B4%B9%E6%9B%BC%E6%8A%80%E5%B7%A7/","excerpt":"费曼技巧概述费曼技巧是一种学习方法，帮助人们快速的学习、掌握一门知识或者技能。费曼本人没有明确提出过费曼技巧这个说法，是人们根据费曼的文章、授课方法总结而来的。费曼这个人呢，是一位有名的物理学家，擅长通过讲述的方式，将高深的知识传授给学生。关于费曼先生的其他几个事情： 1965年获得了诺贝尔物理学奖，奖励其在量子力学中的贡献 1943年，费曼先生参加了曼哈顿工程，为第一个颗原子弹成功研制做出了贡献。 费曼先生是比尔.盖茨的偶像之一，比尔.盖茨对费曼先生的学习方法尤其推崇，将其部分授课的视频版权买过来后，放在网上供大家学习 **费曼，最优秀的老师 The Best Teacher I Never Had**。","text":"费曼技巧概述费曼技巧是一种学习方法，帮助人们快速的学习、掌握一门知识或者技能。费曼本人没有明确提出过费曼技巧这个说法，是人们根据费曼的文章、授课方法总结而来的。费曼这个人呢，是一位有名的物理学家，擅长通过讲述的方式，将高深的知识传授给学生。关于费曼先生的其他几个事情： 1965年获得了诺贝尔物理学奖，奖励其在量子力学中的贡献 1943年，费曼先生参加了曼哈顿工程，为第一个颗原子弹成功研制做出了贡献。 费曼先生是比尔.盖茨的偶像之一，比尔.盖茨对费曼先生的学习方法尤其推崇，将其部分授课的视频版权买过来后，放在网上供大家学习 **费曼，最优秀的老师 The Best Teacher I Never Had**。 费曼技巧的内容费曼技巧主要有4个步骤 确定一个要学习的主题将这个主题，写在一张白纸上。 将这个主题用自己的语言，教会给一个初学者（对这个主题不了解的人员）假设你正在向一个初学者，对这个完全不了解的人讲述这个主题。你需要让他完全明白需要掌握的内容，这个事情，你会更加清楚，自己对这个主题，还有哪些地方掌握的不足。 如果在教授的过程中卡壳了，重新回到原始的学习材料继续学习无论什么时候，只要感觉自己卡壳了，就重新回到原始的学习材料，继续学习，直到自己掌握为止。 总结并归纳为了让自己的讲述过程通俗易懂，简化自己的语言，可以利用一些沟通的技巧如：比喻、举例等。 费曼技巧本身内容较少，很容易记住并理解，但难点在如何应用并实践。比如: 第一、如何掌握并理解原始的学习材料，费曼大人没有说啊，向我等天资愚钝之人，看书都很困苦，第一步就直接卡壳。 第二、讲述的过程，使用哪种技巧也没有说明的，这个需要考个人领悟。 第三、总结归纳，历来简答题中最后压轴大题，根据上下文，概括中心思想，没有指出可操作的方法。 总之，费曼技巧可以理解为一种上层心法，至于如何发挥作用，达到何种境界，看个人造化。 参考资料推荐费曼技巧是有科学依据。美国的一个小伙子，斯科特.杨，利用费曼技巧，一年内修完了MIT4年33门课，自然，杨少侠原本也是天赋异禀之人，他还写了一本书《Learn More Study Less》中文版《如何高效学习》,书中提供了详细的学习技巧，大家可以参考。 知乎问答:号称快速学习的费曼技巧，究竟是什么？ The Feynman Technique: The Best Way to Learn Anything 技巧实践利用费曼技巧重新学习的主题清单： 软件工程","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"mem","slug":"mem","permalink":"http://imesong.com/tags/mem/"},{"name":"tools","slug":"tools","permalink":"http://imesong.com/tags/tools/"},{"name":"okr","slug":"okr","permalink":"http://imesong.com/tags/okr/"},{"name":"2023","slug":"2023","permalink":"http://imesong.com/tags/2023/"},{"name":"pkm","slug":"pkm","permalink":"http://imesong.com/tags/pkm/"},{"name":"readingnotes","slug":"readingnotes","permalink":"http://imesong.com/tags/readingnotes/"},{"name":"summary","slug":"summary","permalink":"http://imesong.com/tags/summary/"},{"name":"2022","slug":"2022","permalink":"http://imesong.com/tags/2022/"},{"name":"2021","slug":"2021","permalink":"http://imesong.com/tags/2021/"},{"name":"android","slug":"android","permalink":"http://imesong.com/tags/android/"},{"name":"技术体系","slug":"技术体系","permalink":"http://imesong.com/tags/%E6%8A%80%E6%9C%AF%E4%BD%93%E7%B3%BB/"},{"name":"写作","slug":"写作","permalink":"http://imesong.com/tags/%E5%86%99%E4%BD%9C/"}]}